Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
extern volatile __IPC41bits_t IPC41bits __asm__ ("IPC41") __attribute__((section("sfrs"), address(0xBF8103D0)));
extern volatile uint32_t        IPC41CLR __attribute__((section("sfrs"),address(0xBF8103D4)));
extern volatile uint32_t        IPC41SET __attribute__((section("sfrs"),address(0xBF8103D8)));
extern volatile uint32_t        IPC41INV __attribute__((section("sfrs"),address(0xBF8103DC)));
#define IPC42 IPC42
extern volatile uint32_t   IPC42 __attribute__((section("sfrs"), address(0xBF8103E0)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t QEI1IS:2;
    uint32_t QEI1IP:3;
    uint32_t :3;
    uint32_t QEI2IS:2;
    uint32_t QEI2IP:3;
    uint32_t :3;
    uint32_t PWMPEVTIS:2;
    uint32_t PWMPEVTIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC42bits_t;
extern volatile __IPC42bits_t IPC42bits __asm__ ("IPC42") __attribute__((section("sfrs"), address(0xBF8103E0)));
extern volatile uint32_t        IPC42CLR __attribute__((section("sfrs"),address(0xBF8103E4)));
extern volatile uint32_t        IPC42SET __attribute__((section("sfrs"),address(0xBF8103E8)));
extern volatile uint32_t        IPC42INV __attribute__((section("sfrs"),address(0xBF8103EC)));
#define IPC43 IPC43
extern volatile uint32_t   IPC43 __attribute__((section("sfrs"), address(0xBF8103F0)));
typedef union {
  struct {
    uint32_t PWMSEVTIS:2;
    uint32_t PWMSEVTIP:3;
    uint32_t :3;
    uint32_t PWM1IS:2;
    uint32_t PWM1IP:3;
    uint32_t :3;
    uint32_t PWM2IS:2;
    uint32_t PWM2IP:3;
    uint32_t :3;
    uint32_t PWM3IS:2;
    uint32_t PWM3IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC43bits_t;
extern volatile __IPC43bits_t IPC43bits __asm__ ("IPC43") __attribute__((section("sfrs"), address(0xBF8103F0)));
extern volatile uint32_t        IPC43CLR __attribute__((section("sfrs"),address(0xBF8103F4)));
extern volatile uint32_t        IPC43SET __attribute__((section("sfrs"),address(0xBF8103F8)));
extern volatile uint32_t        IPC43INV __attribute__((section("sfrs"),address(0xBF8103FC)));
#define IPC44 IPC44
extern volatile uint32_t   IPC44 __attribute__((section("sfrs"), address(0xBF810400)));
typedef union {
  struct {
    uint32_t PWM4IS:2;
    uint32_t PWM4IP:3;
    uint32_t :3;
    uint32_t PWM5IS:2;
    uint32_t PWM5IP:3;
    uint32_t :3;
    uint32_t PWM6IS:2;
    uint32_t PWM6IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC44bits_t;
extern volatile __IPC44bits_t IPC44bits __asm__ ("IPC44") __attribute__((section("sfrs"), address(0xBF810400)));
extern volatile uint32_t        IPC44CLR __attribute__((section("sfrs"),address(0xBF810404)));
extern volatile uint32_t        IPC44SET __attribute__((section("sfrs"),address(0xBF810408)));
extern volatile uint32_t        IPC44INV __attribute__((section("sfrs"),address(0xBF81040C)));
#define IPC45 IPC45
extern volatile uint32_t   IPC45 __attribute__((section("sfrs"), address(0xBF810410)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t DMA4IS:2;
    uint32_t DMA4IP:3;
    uint32_t :3;
    uint32_t DMA5IS:2;
    uint32_t DMA5IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC45bits_t;
extern volatile __IPC45bits_t IPC45bits __asm__ ("IPC45") __attribute__((section("sfrs"), address(0xBF810410)));
extern volatile uint32_t        IPC45CLR __attribute__((section("sfrs"),address(0xBF810414)));
extern volatile uint32_t        IPC45SET __attribute__((section("sfrs"),address(0xBF810418)));
extern volatile uint32_t        IPC45INV __attribute__((section("sfrs"),address(0xBF81041C)));
#define IPC46 IPC46
extern volatile uint32_t   IPC46 __attribute__((section("sfrs"), address(0xBF810420)));
typedef union {
  struct {
    uint32_t DMA6IS:2;
    uint32_t DMA6IP:3;
    uint32_t :3;
    uint32_t DMA7IS:2;
    uint32_t DMA7IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC46bits_t;
extern volatile __IPC46bits_t IPC46bits __asm__ ("IPC46") __attribute__((section("sfrs"), address(0xBF810420)));
extern volatile uint32_t        IPC46CLR __attribute__((section("sfrs"),address(0xBF810424)));
extern volatile uint32_t        IPC46SET __attribute__((section("sfrs"),address(0xBF810428)));
extern volatile uint32_t        IPC46INV __attribute__((section("sfrs"),address(0xBF81042C)));
#define IPC47 IPC47
extern volatile uint32_t   IPC47 __attribute__((section("sfrs"), address(0xBF810430)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t QEI3IS:2;
    uint32_t QEI3IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC47bits_t;
extern volatile __IPC47bits_t IPC47bits __asm__ ("IPC47") __attribute__((section("sfrs"), address(0xBF810430)));
extern volatile uint32_t        IPC47CLR __attribute__((section("sfrs"),address(0xBF810434)));
extern volatile uint32_t        IPC47SET __attribute__((section("sfrs"),address(0xBF810438)));
extern volatile uint32_t        IPC47INV __attribute__((section("sfrs"),address(0xBF81043C)));
#define IPC57 IPC57
extern volatile uint32_t   IPC57 __attribute__((section("sfrs"), address(0xBF8104D0)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t SBIS:2;
    uint32_t SBIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC57bits_t;
extern volatile __IPC57bits_t IPC57bits __asm__ ("IPC57") __attribute__((section("sfrs"), address(0xBF8104D0)));
extern volatile uint32_t        IPC57CLR __attribute__((section("sfrs"),address(0xBF8104D4)));
extern volatile uint32_t        IPC57SET __attribute__((section("sfrs"),address(0xBF8104D8)));
extern volatile uint32_t        IPC57INV __attribute__((section("sfrs"),address(0xBF8104DC)));
#define IPC59 IPC59
extern volatile uint32_t   IPC59 __attribute__((section("sfrs"), address(0xBF8104F0)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t PWM7IS:2;
    uint32_t PWM7IP:3;
    uint32_t :3;
    uint32_t PWM8IS:2;
    uint32_t PWM8IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC59bits_t;
extern volatile __IPC59bits_t IPC59bits __asm__ ("IPC59") __attribute__((section("sfrs"), address(0xBF8104F0)));
extern volatile uint32_t        IPC59CLR __attribute__((section("sfrs"),address(0xBF8104F4)));
extern volatile uint32_t        IPC59SET __attribute__((section("sfrs"),address(0xBF8104F8)));
extern volatile uint32_t        IPC59INV __attribute__((section("sfrs"),address(0xBF8104FC)));
#define IPC60 IPC60
extern volatile uint32_t   IPC60 __attribute__((section("sfrs"), address(0xBF810500)));
typedef union {
  struct {
    uint32_t PWM9IS:2;
    uint32_t PWM9IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC60bits_t;
extern volatile __IPC60bits_t IPC60bits __asm__ ("IPC60") __attribute__((section("sfrs"), address(0xBF810500)));
extern volatile uint32_t        IPC60CLR __attribute__((section("sfrs"),address(0xBF810504)));
extern volatile uint32_t        IPC60SET __attribute__((section("sfrs"),address(0xBF810508)));
extern volatile uint32_t        IPC60INV __attribute__((section("sfrs"),address(0xBF81050C)));
#define IPC61 IPC61
extern volatile uint32_t   IPC61 __attribute__((section("sfrs"), address(0xBF810510)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t AD1DC3IS:2;
    uint32_t AD1DC3IP:3;
    uint32_t :3;
    uint32_t AD1DC4IS:2;
    uint32_t AD1DC4IP:3;
    uint32_t :3;
    uint32_t PCACHEIS:2;
    uint32_t PCACHEIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC61bits_t;
extern volatile __IPC61bits_t IPC61bits __asm__ ("IPC61") __attribute__((section("sfrs"), address(0xBF810510)));
extern volatile uint32_t        IPC61CLR __attribute__((section("sfrs"),address(0xBF810514)));
extern volatile uint32_t        IPC61SET __attribute__((section("sfrs"),address(0xBF810518)));
extern volatile uint32_t        IPC61INV __attribute__((section("sfrs"),address(0xBF81051C)));
#define IPC62 IPC62
extern volatile uint32_t   IPC62 __attribute__((section("sfrs"), address(0xBF810520)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t CLC1IS:2;
    uint32_t CLC1IP:3;
    uint32_t :3;
    uint32_t CLC2IS:2;
    uint32_t CLC2IP:3;
    uint32_t :3;
    uint32_t CLC3IS:2;
    uint32_t CLC3IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC62bits_t;
