Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
extern volatile __SDC3bits_t SDC3bits __asm__ ("SDC3") __attribute__((section("sfrs"), address(0xBF82A2F0)));
extern volatile uint32_t        SDC3CLR __attribute__((section("sfrs"),address(0xBF82A2F4)));
extern volatile uint32_t        SDC3SET __attribute__((section("sfrs"),address(0xBF82A2F8)));
extern volatile uint32_t        SDC3INV __attribute__((section("sfrs"),address(0xBF82A2FC)));
#define PHASE3 PHASE3
extern volatile uint32_t   PHASE3 __attribute__((section("sfrs"), address(0xBF82A300)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE3bits_t;
extern volatile __PHASE3bits_t PHASE3bits __asm__ ("PHASE3") __attribute__((section("sfrs"), address(0xBF82A300)));
extern volatile uint32_t        PHASE3CLR __attribute__((section("sfrs"),address(0xBF82A304)));
extern volatile uint32_t        PHASE3SET __attribute__((section("sfrs"),address(0xBF82A308)));
extern volatile uint32_t        PHASE3INV __attribute__((section("sfrs"),address(0xBF82A30C)));
#define DTR3 DTR3
extern volatile uint32_t   DTR3 __attribute__((section("sfrs"), address(0xBF82A310)));
typedef struct {
  uint32_t DTR:16;
} __DTR3bits_t;
extern volatile __DTR3bits_t DTR3bits __asm__ ("DTR3") __attribute__((section("sfrs"), address(0xBF82A310)));
extern volatile uint32_t        DTR3CLR __attribute__((section("sfrs"),address(0xBF82A314)));
extern volatile uint32_t        DTR3SET __attribute__((section("sfrs"),address(0xBF82A318)));
extern volatile uint32_t        DTR3INV __attribute__((section("sfrs"),address(0xBF82A31C)));
#define ALTDTR3 ALTDTR3
extern volatile uint32_t   ALTDTR3 __attribute__((section("sfrs"), address(0xBF82A320)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR3bits_t;
extern volatile __ALTDTR3bits_t ALTDTR3bits __asm__ ("ALTDTR3") __attribute__((section("sfrs"), address(0xBF82A320)));
extern volatile uint32_t        ALTDTR3CLR __attribute__((section("sfrs"),address(0xBF82A324)));
extern volatile uint32_t        ALTDTR3SET __attribute__((section("sfrs"),address(0xBF82A328)));
extern volatile uint32_t        ALTDTR3INV __attribute__((section("sfrs"),address(0xBF82A32C)));
#define DTCOMP3 DTCOMP3
extern volatile uint32_t   DTCOMP3 __attribute__((section("sfrs"), address(0xBF82A330)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP3bits_t;
extern volatile __DTCOMP3bits_t DTCOMP3bits __asm__ ("DTCOMP3") __attribute__((section("sfrs"), address(0xBF82A330)));
extern volatile uint32_t        DTCOMP3CLR __attribute__((section("sfrs"),address(0xBF82A334)));
extern volatile uint32_t        DTCOMP3SET __attribute__((section("sfrs"),address(0xBF82A338)));
extern volatile uint32_t        DTCOMP3INV __attribute__((section("sfrs"),address(0xBF82A33C)));
#define TRIG3 TRIG3
extern volatile uint32_t   TRIG3 __attribute__((section("sfrs"), address(0xBF82A340)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG3bits_t;
extern volatile __TRIG3bits_t TRIG3bits __asm__ ("TRIG3") __attribute__((section("sfrs"), address(0xBF82A340)));
extern volatile uint32_t        TRIG3CLR __attribute__((section("sfrs"),address(0xBF82A344)));
extern volatile uint32_t        TRIG3SET __attribute__((section("sfrs"),address(0xBF82A348)));
extern volatile uint32_t        TRIG3INV __attribute__((section("sfrs"),address(0xBF82A34C)));
#define TRGCON3 TRGCON3
extern volatile uint32_t   TRGCON3 __attribute__((section("sfrs"), address(0xBF82A350)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON3bits_t;
extern volatile __TRGCON3bits_t TRGCON3bits __asm__ ("TRGCON3") __attribute__((section("sfrs"), address(0xBF82A350)));
extern volatile uint32_t        TRGCON3CLR __attribute__((section("sfrs"),address(0xBF82A354)));
extern volatile uint32_t        TRGCON3SET __attribute__((section("sfrs"),address(0xBF82A358)));
extern volatile uint32_t        TRGCON3INV __attribute__((section("sfrs"),address(0xBF82A35C)));
#define STRIG3 STRIG3
extern volatile uint32_t   STRIG3 __attribute__((section("sfrs"), address(0xBF82A360)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG3bits_t;
extern volatile __STRIG3bits_t STRIG3bits __asm__ ("STRIG3") __attribute__((section("sfrs"), address(0xBF82A360)));
extern volatile uint32_t        STRIG3CLR __attribute__((section("sfrs"),address(0xBF82A364)));
extern volatile uint32_t        STRIG3SET __attribute__((section("sfrs"),address(0xBF82A368)));
extern volatile uint32_t        STRIG3INV __attribute__((section("sfrs"),address(0xBF82A36C)));
#define CAP3 CAP3
extern volatile uint32_t   CAP3 __attribute__((section("sfrs"), address(0xBF82A370)));
typedef struct {
  uint32_t CAP:16;
} __CAP3bits_t;
extern volatile __CAP3bits_t CAP3bits __asm__ ("CAP3") __attribute__((section("sfrs"), address(0xBF82A370)));
extern volatile uint32_t        CAP3CLR __attribute__((section("sfrs"),address(0xBF82A374)));
extern volatile uint32_t        CAP3SET __attribute__((section("sfrs"),address(0xBF82A378)));
extern volatile uint32_t        CAP3INV __attribute__((section("sfrs"),address(0xBF82A37C)));
#define LEBCON3 LEBCON3
extern volatile uint32_t   LEBCON3 __attribute__((section("sfrs"), address(0xBF82A380)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON3bits_t;
extern volatile __LEBCON3bits_t LEBCON3bits __asm__ ("LEBCON3") __attribute__((section("sfrs"), address(0xBF82A380)));
extern volatile uint32_t        LEBCON3CLR __attribute__((section("sfrs"),address(0xBF82A384)));
extern volatile uint32_t        LEBCON3SET __attribute__((section("sfrs"),address(0xBF82A388)));
extern volatile uint32_t        LEBCON3INV __attribute__((section("sfrs"),address(0xBF82A38C)));
#define LEBDLY3 LEBDLY3
extern volatile uint32_t   LEBDLY3 __attribute__((section("sfrs"), address(0xBF82A390)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY3bits_t;
extern volatile __LEBDLY3bits_t LEBDLY3bits __asm__ ("LEBDLY3") __attribute__((section("sfrs"), address(0xBF82A390)));
extern volatile uint32_t        LEBDLY3CLR __attribute__((section("sfrs"),address(0xBF82A394)));
extern volatile uint32_t        LEBDLY3SET __attribute__((section("sfrs"),address(0xBF82A398)));
extern volatile uint32_t        LEBDLY3INV __attribute__((section("sfrs"),address(0xBF82A39C)));
#define AUXCON3 AUXCON3
extern volatile uint32_t   AUXCON3 __attribute__((section("sfrs"), address(0xBF82A3A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON3bits_t;
extern volatile __AUXCON3bits_t AUXCON3bits __asm__ ("AUXCON3") __attribute__((section("sfrs"), address(0xBF82A3A0)));
extern volatile uint32_t        AUXCON3CLR __attribute__((section("sfrs"),address(0xBF82A3A4)));
extern volatile uint32_t        AUXCON3SET __attribute__((section("sfrs"),address(0xBF82A3A8)));
extern volatile uint32_t        AUXCON3INV __attribute__((section("sfrs"),address(0xBF82A3AC)));
#define PTMR3 PTMR3
extern volatile uint32_t   PTMR3 __attribute__((section("sfrs"), address(0xBF82A3B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR3bits_t;
extern volatile __PTMR3bits_t PTMR3bits __asm__ ("PTMR3") __attribute__((section("sfrs"), address(0xBF82A3B0)));
extern volatile uint32_t        PTMR3CLR __attribute__((section("sfrs"),address(0xBF82A3B4)));
extern volatile uint32_t        PTMR3SET __attribute__((section("sfrs"),address(0xBF82A3B8)));
extern volatile uint32_t        PTMR3INV __attribute__((section("sfrs"),address(0xBF82A3BC)));
#define PWMCON4 PWMCON4
extern volatile uint32_t   PWMCON4 __attribute__((section("sfrs"), address(0xBF82A3C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON4bits_t;
