Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
extern volatile __STRIG7bits_t STRIG7bits __asm__ ("STRIG7") __attribute__((section("sfrs"), address(0xBF82A760)));
extern volatile uint32_t        STRIG7CLR __attribute__((section("sfrs"),address(0xBF82A764)));
extern volatile uint32_t        STRIG7SET __attribute__((section("sfrs"),address(0xBF82A768)));
extern volatile uint32_t        STRIG7INV __attribute__((section("sfrs"),address(0xBF82A76C)));
#define CAP7 CAP7
extern volatile uint32_t   CAP7 __attribute__((section("sfrs"), address(0xBF82A770)));
typedef struct {
  uint32_t CAP:16;
} __CAP7bits_t;
extern volatile __CAP7bits_t CAP7bits __asm__ ("CAP7") __attribute__((section("sfrs"), address(0xBF82A770)));
extern volatile uint32_t        CAP7CLR __attribute__((section("sfrs"),address(0xBF82A774)));
extern volatile uint32_t        CAP7SET __attribute__((section("sfrs"),address(0xBF82A778)));
extern volatile uint32_t        CAP7INV __attribute__((section("sfrs"),address(0xBF82A77C)));
#define LEBCON7 LEBCON7
extern volatile uint32_t   LEBCON7 __attribute__((section("sfrs"), address(0xBF82A780)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON7bits_t;
extern volatile __LEBCON7bits_t LEBCON7bits __asm__ ("LEBCON7") __attribute__((section("sfrs"), address(0xBF82A780)));
extern volatile uint32_t        LEBCON7CLR __attribute__((section("sfrs"),address(0xBF82A784)));
extern volatile uint32_t        LEBCON7SET __attribute__((section("sfrs"),address(0xBF82A788)));
extern volatile uint32_t        LEBCON7INV __attribute__((section("sfrs"),address(0xBF82A78C)));
#define LEBDLY7 LEBDLY7
extern volatile uint32_t   LEBDLY7 __attribute__((section("sfrs"), address(0xBF82A790)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY7bits_t;
extern volatile __LEBDLY7bits_t LEBDLY7bits __asm__ ("LEBDLY7") __attribute__((section("sfrs"), address(0xBF82A790)));
extern volatile uint32_t        LEBDLY7CLR __attribute__((section("sfrs"),address(0xBF82A794)));
extern volatile uint32_t        LEBDLY7SET __attribute__((section("sfrs"),address(0xBF82A798)));
extern volatile uint32_t        LEBDLY7INV __attribute__((section("sfrs"),address(0xBF82A79C)));
#define AUXCON7 AUXCON7
extern volatile uint32_t   AUXCON7 __attribute__((section("sfrs"), address(0xBF82A7A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON7bits_t;
extern volatile __AUXCON7bits_t AUXCON7bits __asm__ ("AUXCON7") __attribute__((section("sfrs"), address(0xBF82A7A0)));
extern volatile uint32_t        AUXCON7CLR __attribute__((section("sfrs"),address(0xBF82A7A4)));
extern volatile uint32_t        AUXCON7SET __attribute__((section("sfrs"),address(0xBF82A7A8)));
extern volatile uint32_t        AUXCON7INV __attribute__((section("sfrs"),address(0xBF82A7AC)));
#define PTMR7 PTMR7
extern volatile uint32_t   PTMR7 __attribute__((section("sfrs"), address(0xBF82A7B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR7bits_t;
extern volatile __PTMR7bits_t PTMR7bits __asm__ ("PTMR7") __attribute__((section("sfrs"), address(0xBF82A7B0)));
extern volatile uint32_t        PTMR7CLR __attribute__((section("sfrs"),address(0xBF82A7B4)));
extern volatile uint32_t        PTMR7SET __attribute__((section("sfrs"),address(0xBF82A7B8)));
extern volatile uint32_t        PTMR7INV __attribute__((section("sfrs"),address(0xBF82A7BC)));
#define PWMCON8 PWMCON8
extern volatile uint32_t   PWMCON8 __attribute__((section("sfrs"), address(0xBF82A7C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON8bits_t;
extern volatile __PWMCON8bits_t PWMCON8bits __asm__ ("PWMCON8") __attribute__((section("sfrs"), address(0xBF82A7C0)));
extern volatile uint32_t        PWMCON8CLR __attribute__((section("sfrs"),address(0xBF82A7C4)));
extern volatile uint32_t        PWMCON8SET __attribute__((section("sfrs"),address(0xBF82A7C8)));
extern volatile uint32_t        PWMCON8INV __attribute__((section("sfrs"),address(0xBF82A7CC)));
#define IOCON8 IOCON8
extern volatile uint32_t   IOCON8 __attribute__((section("sfrs"), address(0xBF82A7D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON8bits_t;
extern volatile __IOCON8bits_t IOCON8bits __asm__ ("IOCON8") __attribute__((section("sfrs"), address(0xBF82A7D0)));
extern volatile uint32_t        IOCON8CLR __attribute__((section("sfrs"),address(0xBF82A7D4)));
extern volatile uint32_t        IOCON8SET __attribute__((section("sfrs"),address(0xBF82A7D8)));
extern volatile uint32_t        IOCON8INV __attribute__((section("sfrs"),address(0xBF82A7DC)));
#define PDC8 PDC8
extern volatile uint32_t   PDC8 __attribute__((section("sfrs"), address(0xBF82A7E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC8bits_t;
extern volatile __PDC8bits_t PDC8bits __asm__ ("PDC8") __attribute__((section("sfrs"), address(0xBF82A7E0)));
extern volatile uint32_t        PDC8CLR __attribute__((section("sfrs"),address(0xBF82A7E4)));
extern volatile uint32_t        PDC8SET __attribute__((section("sfrs"),address(0xBF82A7E8)));
extern volatile uint32_t        PDC8INV __attribute__((section("sfrs"),address(0xBF82A7EC)));
#define SDC8 SDC8
extern volatile uint32_t   SDC8 __attribute__((section("sfrs"), address(0xBF82A7F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC8bits_t;
extern volatile __SDC8bits_t SDC8bits __asm__ ("SDC8") __attribute__((section("sfrs"), address(0xBF82A7F0)));
extern volatile uint32_t        SDC8CLR __attribute__((section("sfrs"),address(0xBF82A7F4)));
extern volatile uint32_t        SDC8SET __attribute__((section("sfrs"),address(0xBF82A7F8)));
extern volatile uint32_t        SDC8INV __attribute__((section("sfrs"),address(0xBF82A7FC)));
#define PHASE8 PHASE8
extern volatile uint32_t   PHASE8 __attribute__((section("sfrs"), address(0xBF82A800)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE8bits_t;
extern volatile __PHASE8bits_t PHASE8bits __asm__ ("PHASE8") __attribute__((section("sfrs"), address(0xBF82A800)));
extern volatile uint32_t        PHASE8CLR __attribute__((section("sfrs"),address(0xBF82A804)));
extern volatile uint32_t        PHASE8SET __attribute__((section("sfrs"),address(0xBF82A808)));
extern volatile uint32_t        PHASE8INV __attribute__((section("sfrs"),address(0xBF82A80C)));
#define DTR8 DTR8
extern volatile uint32_t   DTR8 __attribute__((section("sfrs"), address(0xBF82A810)));
typedef struct {
  uint32_t DTR:16;
} __DTR8bits_t;
extern volatile __DTR8bits_t DTR8bits __asm__ ("DTR8") __attribute__((section("sfrs"), address(0xBF82A810)));
extern volatile uint32_t        DTR8CLR __attribute__((section("sfrs"),address(0xBF82A814)));
extern volatile uint32_t        DTR8SET __attribute__((section("sfrs"),address(0xBF82A818)));
extern volatile uint32_t        DTR8INV __attribute__((section("sfrs"),address(0xBF82A81C)));
#define ALTDTR8 ALTDTR8
extern volatile uint32_t   ALTDTR8 __attribute__((section("sfrs"), address(0xBF82A820)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR8bits_t;
extern volatile __ALTDTR8bits_t ALTDTR8bits __asm__ ("ALTDTR8") __attribute__((section("sfrs"), address(0xBF82A820)));
extern volatile uint32_t        ALTDTR8CLR __attribute__((section("sfrs"),address(0xBF82A824)));
extern volatile uint32_t        ALTDTR8SET __attribute__((section("sfrs"),address(0xBF82A828)));
extern volatile uint32_t        ALTDTR8INV __attribute__((section("sfrs"),address(0xBF82A82C)));
#define DTCOMP8 DTCOMP8
extern volatile uint32_t   DTCOMP8 __attribute__((section("sfrs"), address(0xBF82A830)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP8bits_t;
extern volatile __DTCOMP8bits_t DTCOMP8bits __asm__ ("DTCOMP8") __attribute__((section("sfrs"), address(0xBF82A830)));
extern volatile uint32_t        DTCOMP8CLR __attribute__((section("sfrs"),address(0xBF82A834)));
extern volatile uint32_t        DTCOMP8SET __attribute__((section("sfrs"),address(0xBF82A838)));
extern volatile uint32_t        DTCOMP8INV __attribute__((section("sfrs"),address(0xBF82A83C)));
#define TRIG8 TRIG8
extern volatile uint32_t   TRIG8 __attribute__((section("sfrs"), address(0xBF82A840)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG8bits_t;
