Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
extern volatile __CFD1FIFOSTA7bits_t CFD1FIFOSTA7bits __asm__ ("CFD1FIFOSTA7") __attribute__((section("sfrs"), address(0xBF8802A0)));
extern volatile uint32_t        CFD1FIFOSTA7CLR __attribute__((section("sfrs"),address(0xBF8802A4)));
extern volatile uint32_t        CFD1FIFOSTA7SET __attribute__((section("sfrs"),address(0xBF8802A8)));
extern volatile uint32_t        CFD1FIFOSTA7INV __attribute__((section("sfrs"),address(0xBF8802AC)));
#define CFD1FIFOUA7 CFD1FIFOUA7
extern volatile uint32_t   CFD1FIFOUA7 __attribute__((section("sfrs"), address(0xBF8802B0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA7bits_t;
extern volatile __CFD1FIFOUA7bits_t CFD1FIFOUA7bits __asm__ ("CFD1FIFOUA7") __attribute__((section("sfrs"), address(0xBF8802B0)));
extern volatile uint32_t        CFD1FIFOUA7CLR __attribute__((section("sfrs"),address(0xBF8802B4)));
extern volatile uint32_t        CFD1FIFOUA7SET __attribute__((section("sfrs"),address(0xBF8802B8)));
extern volatile uint32_t        CFD1FIFOUA7INV __attribute__((section("sfrs"),address(0xBF8802BC)));
#define CFD1FIFOCON8 CFD1FIFOCON8
extern volatile uint32_t   CFD1FIFOCON8 __attribute__((section("sfrs"), address(0xBF8802C0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON8bits_t;
extern volatile __CFD1FIFOCON8bits_t CFD1FIFOCON8bits __asm__ ("CFD1FIFOCON8") __attribute__((section("sfrs"), address(0xBF8802C0)));
extern volatile uint32_t        CFD1FIFOCON8CLR __attribute__((section("sfrs"),address(0xBF8802C4)));
extern volatile uint32_t        CFD1FIFOCON8SET __attribute__((section("sfrs"),address(0xBF8802C8)));
extern volatile uint32_t        CFD1FIFOCON8INV __attribute__((section("sfrs"),address(0xBF8802CC)));
#define CFD1FIFOSTA8 CFD1FIFOSTA8
extern volatile uint32_t   CFD1FIFOSTA8 __attribute__((section("sfrs"), address(0xBF8802D0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA8bits_t;
extern volatile __CFD1FIFOSTA8bits_t CFD1FIFOSTA8bits __asm__ ("CFD1FIFOSTA8") __attribute__((section("sfrs"), address(0xBF8802D0)));
extern volatile uint32_t        CFD1FIFOSTA8CLR __attribute__((section("sfrs"),address(0xBF8802D4)));
extern volatile uint32_t        CFD1FIFOSTA8SET __attribute__((section("sfrs"),address(0xBF8802D8)));
extern volatile uint32_t        CFD1FIFOSTA8INV __attribute__((section("sfrs"),address(0xBF8802DC)));
#define CFD1FIFOUA8 CFD1FIFOUA8
extern volatile uint32_t   CFD1FIFOUA8 __attribute__((section("sfrs"), address(0xBF8802E0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA8bits_t;
extern volatile __CFD1FIFOUA8bits_t CFD1FIFOUA8bits __asm__ ("CFD1FIFOUA8") __attribute__((section("sfrs"), address(0xBF8802E0)));
extern volatile uint32_t        CFD1FIFOUA8CLR __attribute__((section("sfrs"),address(0xBF8802E4)));
extern volatile uint32_t        CFD1FIFOUA8SET __attribute__((section("sfrs"),address(0xBF8802E8)));
extern volatile uint32_t        CFD1FIFOUA8INV __attribute__((section("sfrs"),address(0xBF8802EC)));
#define CFD1FIFOCON9 CFD1FIFOCON9
extern volatile uint32_t   CFD1FIFOCON9 __attribute__((section("sfrs"), address(0xBF8802F0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON9bits_t;
extern volatile __CFD1FIFOCON9bits_t CFD1FIFOCON9bits __asm__ ("CFD1FIFOCON9") __attribute__((section("sfrs"), address(0xBF8802F0)));
extern volatile uint32_t        CFD1FIFOCON9CLR __attribute__((section("sfrs"),address(0xBF8802F4)));
extern volatile uint32_t        CFD1FIFOCON9SET __attribute__((section("sfrs"),address(0xBF8802F8)));
extern volatile uint32_t        CFD1FIFOCON9INV __attribute__((section("sfrs"),address(0xBF8802FC)));
#define CFD1FIFOSTA9 CFD1FIFOSTA9
extern volatile uint32_t   CFD1FIFOSTA9 __attribute__((section("sfrs"), address(0xBF880300)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA9bits_t;
extern volatile __CFD1FIFOSTA9bits_t CFD1FIFOSTA9bits __asm__ ("CFD1FIFOSTA9") __attribute__((section("sfrs"), address(0xBF880300)));
extern volatile uint32_t        CFD1FIFOSTA9CLR __attribute__((section("sfrs"),address(0xBF880304)));
extern volatile uint32_t        CFD1FIFOSTA9SET __attribute__((section("sfrs"),address(0xBF880308)));
extern volatile uint32_t        CFD1FIFOSTA9INV __attribute__((section("sfrs"),address(0xBF88030C)));
#define CFD1FIFOUA9 CFD1FIFOUA9
extern volatile uint32_t   CFD1FIFOUA9 __attribute__((section("sfrs"), address(0xBF880310)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA9bits_t;
extern volatile __CFD1FIFOUA9bits_t CFD1FIFOUA9bits __asm__ ("CFD1FIFOUA9") __attribute__((section("sfrs"), address(0xBF880310)));
extern volatile uint32_t        CFD1FIFOUA9CLR __attribute__((section("sfrs"),address(0xBF880314)));
extern volatile uint32_t        CFD1FIFOUA9SET __attribute__((section("sfrs"),address(0xBF880318)));
extern volatile uint32_t        CFD1FIFOUA9INV __attribute__((section("sfrs"),address(0xBF88031C)));
#define CFD1FIFOCON10 CFD1FIFOCON10
extern volatile uint32_t   CFD1FIFOCON10 __attribute__((section("sfrs"), address(0xBF880320)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON10bits_t;
extern volatile __CFD1FIFOCON10bits_t CFD1FIFOCON10bits __asm__ ("CFD1FIFOCON10") __attribute__((section("sfrs"), address(0xBF880320)));
extern volatile uint32_t        CFD1FIFOCON10CLR __attribute__((section("sfrs"),address(0xBF880324)));
extern volatile uint32_t        CFD1FIFOCON10SET __attribute__((section("sfrs"),address(0xBF880328)));
extern volatile uint32_t        CFD1FIFOCON10INV __attribute__((section("sfrs"),address(0xBF88032C)));
#define CFD1FIFOSTA10 CFD1FIFOSTA10
extern volatile uint32_t   CFD1FIFOSTA10 __attribute__((section("sfrs"), address(0xBF880330)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA10bits_t;
extern volatile __CFD1FIFOSTA10bits_t CFD1FIFOSTA10bits __asm__ ("CFD1FIFOSTA10") __attribute__((section("sfrs"), address(0xBF880330)));
extern volatile uint32_t        CFD1FIFOSTA10CLR __attribute__((section("sfrs"),address(0xBF880334)));
extern volatile uint32_t        CFD1FIFOSTA10SET __attribute__((section("sfrs"),address(0xBF880338)));
extern volatile uint32_t        CFD1FIFOSTA10INV __attribute__((section("sfrs"),address(0xBF88033C)));
#define CFD1FIFOUA10 CFD1FIFOUA10
extern volatile uint32_t   CFD1FIFOUA10 __attribute__((section("sfrs"), address(0xBF880340)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA10bits_t;
extern volatile __CFD1FIFOUA10bits_t CFD1FIFOUA10bits __asm__ ("CFD1FIFOUA10") __attribute__((section("sfrs"), address(0xBF880340)));
extern volatile uint32_t        CFD1FIFOUA10CLR __attribute__((section("sfrs"),address(0xBF880344)));
extern volatile uint32_t        CFD1FIFOUA10SET __attribute__((section("sfrs"),address(0xBF880348)));
extern volatile uint32_t        CFD1FIFOUA10INV __attribute__((section("sfrs"),address(0xBF88034C)));
#define CFD1FIFOCON11 CFD1FIFOCON11
extern volatile uint32_t   CFD1FIFOCON11 __attribute__((section("sfrs"), address(0xBF880350)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON11bits_t;
extern volatile __CFD1FIFOCON11bits_t CFD1FIFOCON11bits __asm__ ("CFD1FIFOCON11") __attribute__((section("sfrs"), address(0xBF880350)));
extern volatile uint32_t        CFD1FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF880354)));
extern volatile uint32_t        CFD1FIFOCON11SET __attribute__((section("sfrs"),address(0xBF880358)));
extern volatile uint32_t        CFD1FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88035C)));
#define CFD1FIFOSTA11 CFD1FIFOSTA11
extern volatile uint32_t   CFD1FIFOSTA11 __attribute__((section("sfrs"), address(0xBF880360)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA11bits_t;
extern volatile __CFD1FIFOSTA11bits_t CFD1FIFOSTA11bits __asm__ ("CFD1FIFOSTA11") __attribute__((section("sfrs"), address(0xBF880360)));
extern volatile uint32_t        CFD1FIFOSTA11CLR __attribute__((section("sfrs"),address(0xBF880364)));
extern volatile uint32_t        CFD1FIFOSTA11SET __attribute__((section("sfrs"),address(0xBF880368)));
extern volatile uint32_t        CFD1FIFOSTA11INV __attribute__((section("sfrs"),address(0xBF88036C)));
#define CFD1FIFOUA11 CFD1FIFOUA11
extern volatile uint32_t   CFD1FIFOUA11 __attribute__((section("sfrs"), address(0xBF880370)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA11bits_t;
