Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
  .extern CFD1FIFOCON28INV /* 0xBF88068C */
  .extern CFD1FIFOSTA28    /* 0xBF880690 */
  .extern CFD1FIFOSTA28CLR /* 0xBF880694 */
  .extern CFD1FIFOSTA28SET /* 0xBF880698 */
  .extern CFD1FIFOSTA28INV /* 0xBF88069C */
  .extern CFD1FIFOUA28     /* 0xBF8806A0 */
  .extern CFD1FIFOUA28CLR  /* 0xBF8806A4 */
  .extern CFD1FIFOUA28SET  /* 0xBF8806A8 */
  .extern CFD1FIFOUA28INV  /* 0xBF8806AC */
  .extern CFD1FIFOCON29    /* 0xBF8806B0 */
  .extern CFD1FIFOCON29CLR /* 0xBF8806B4 */
  .extern CFD1FIFOCON29SET /* 0xBF8806B8 */
  .extern CFD1FIFOCON29INV /* 0xBF8806BC */
  .extern CFD1FIFOSTA29    /* 0xBF8806C0 */
  .extern CFD1FIFOSTA29CLR /* 0xBF8806C4 */
  .extern CFD1FIFOSTA29SET /* 0xBF8806C8 */
  .extern CFD1FIFOSTA29INV /* 0xBF8806CC */
  .extern CFD1FIFOUA29     /* 0xBF8806D0 */
  .extern CFD1FIFOUA29CLR  /* 0xBF8806D4 */
  .extern CFD1FIFOUA29SET  /* 0xBF8806D8 */
  .extern CFD1FIFOUA29INV  /* 0xBF8806DC */
  .extern CFD1FIFOCON30    /* 0xBF8806E0 */
  .extern CFD1FIFOCON30CLR /* 0xBF8806E4 */
  .extern CFD1FIFOCON30SET /* 0xBF8806E8 */
  .extern CFD1FIFOCON30INV /* 0xBF8806EC */
  .extern CFD1FIFOSTA30    /* 0xBF8806F0 */
  .extern CFD1FIFOSTA30CLR /* 0xBF8806F4 */
  .extern CFD1FIFOSTA30SET /* 0xBF8806F8 */
  .extern CFD1FIFOSTA30INV /* 0xBF8806FC */
  .extern CFD1FIFOUA30     /* 0xBF880700 */
  .extern CFD1FIFOUA30CLR  /* 0xBF880704 */
  .extern CFD1FIFOUA30SET  /* 0xBF880708 */
  .extern CFD1FIFOUA30INV  /* 0xBF88070C */
  .extern CFD1FIFOCON31    /* 0xBF880710 */
  .extern CFD1FIFOCON31CLR /* 0xBF880714 */
  .extern CFD1FIFOCON31SET /* 0xBF880718 */
  .extern CFD1FIFOCON31INV /* 0xBF88071C */
  .extern CFD1FIFOSTA31    /* 0xBF880720 */
  .extern CFD1FIFOSTA31CLR /* 0xBF880724 */
  .extern CFD1FIFOSTA31SET /* 0xBF880728 */
  .extern CFD1FIFOSTA31INV /* 0xBF88072C */
  .extern CFD1FIFOUA31     /* 0xBF880730 */
  .extern CFD1FIFOUA31CLR  /* 0xBF880734 */
  .extern CFD1FIFOUA31SET  /* 0xBF880738 */
  .extern CFD1FIFOUA31INV  /* 0xBF88073C */
  .extern CFD1FLTCON0      /* 0xBF880740 */
  .extern CFD1FLTCON0CLR   /* 0xBF880744 */
  .extern CFD1FLTCON0SET   /* 0xBF880748 */
  .extern CFD1FLTCON0INV   /* 0xBF88074C */
  .extern CFD1FLTCON1      /* 0xBF880750 */
  .extern CFD1FLTCON1CLR   /* 0xBF880754 */
  .extern CFD1FLTCON1SET   /* 0xBF880758 */
  .extern CFD1FLTCON1INV   /* 0xBF88075C */
  .extern CFD1FLTCON2      /* 0xBF880760 */
  .extern CFD1FLTCON2CLR   /* 0xBF880764 */
  .extern CFD1FLTCON2SET   /* 0xBF880768 */
  .extern CFD1FLTCON2INV   /* 0xBF88076C */
  .extern CFD1FLTCON3      /* 0xBF880770 */
  .extern CFD1FLTCON3CLR   /* 0xBF880774 */
  .extern CFD1FLTCON3SET   /* 0xBF880778 */
  .extern CFD1FLTCON3INV   /* 0xBF88077C */
  .extern CFD1FLTCON4      /* 0xBF880780 */
  .extern CFD1FLTCON4CLR   /* 0xBF880784 */
  .extern CFD1FLTCON4SET   /* 0xBF880788 */
  .extern CFD1FLTCON4INV   /* 0xBF88078C */
  .extern CFD1FLTCON5      /* 0xBF880790 */
  .extern CFD1FLTCON5CLR   /* 0xBF880794 */
  .extern CFD1FLTCON5SET   /* 0xBF880798 */
  .extern CFD1FLTCON5INV   /* 0xBF88079C */
  .extern CFD1FLTCON6      /* 0xBF8807A0 */
  .extern CFD1FLTCON6CLR   /* 0xBF8807A4 */
  .extern CFD1FLTCON6SET   /* 0xBF8807A8 */
  .extern CFD1FLTCON6INV   /* 0xBF8807AC */
  .extern CFD1FLTCON7      /* 0xBF8807B0 */
  .extern CFD1FLTCON7CLR   /* 0xBF8807B4 */
  .extern CFD1FLTCON7SET   /* 0xBF8807B8 */
  .extern CFD1FLTCON7INV   /* 0xBF8807BC */
  .extern CFD1FLTOBJ0      /* 0xBF8807C0 */
  .extern CFD1FLTOBJ0CLR   /* 0xBF8807C4 */
  .extern CFD1FLTOBJ0SET   /* 0xBF8807C8 */
  .extern CFD1FLTOBJ0INV   /* 0xBF8807CC */
  .extern CFD1MASK0        /* 0xBF8807D0 */
  .extern CFD1MASK0CLR     /* 0xBF8807D4 */
  .extern CFD1MASK0SET     /* 0xBF8807D8 */
  .extern CFD1MASK0INV     /* 0xBF8807DC */
  .extern CFD1FLTOBJ1      /* 0xBF8807E0 */
  .extern CFD1FLTOBJ1CLR   /* 0xBF8807E4 */
  .extern CFD1FLTOBJ1SET   /* 0xBF8807E8 */
  .extern CFD1FLTOBJ1INV   /* 0xBF8807EC */
  .extern CFD1MASK1        /* 0xBF8807F0 */
  .extern CFD1MASK1CLR     /* 0xBF8807F4 */
  .extern CFD1MASK1SET     /* 0xBF8807F8 */
  .extern CFD1MASK1INV     /* 0xBF8807FC */
  .extern CFD1FLTOBJ2      /* 0xBF880800 */
  .extern CFD1FLTOBJ2CLR   /* 0xBF880804 */
  .extern CFD1FLTOBJ2SET   /* 0xBF880808 */
  .extern CFD1FLTOBJ2INV   /* 0xBF88080C */
  .extern CFD1MASK2        /* 0xBF880810 */
  .extern CFD1MASK2CLR     /* 0xBF880814 */
  .extern CFD1MASK2SET     /* 0xBF880818 */
  .extern CFD1MASK2INV     /* 0xBF88081C */
  .extern CFD1FLTOBJ3      /* 0xBF880820 */
  .extern CFD1FLTOBJ3CLR   /* 0xBF880824 */
  .extern CFD1FLTOBJ3SET   /* 0xBF880828 */
  .extern CFD1FLTOBJ3INV   /* 0xBF88082C */
  .extern CFD1MASK3        /* 0xBF880830 */
  .extern CFD1MASK3CLR     /* 0xBF880834 */
  .extern CFD1MASK3SET     /* 0xBF880838 */
  .extern CFD1MASK3INV     /* 0xBF88083C */
  .extern CFD1FLTOBJ4      /* 0xBF880840 */
  .extern CFD1FLTOBJ4CLR   /* 0xBF880844 */
  .extern CFD1FLTOBJ4SET   /* 0xBF880848 */
  .extern CFD1FLTOBJ4INV   /* 0xBF88084C */
  .extern CFD1MASK4        /* 0xBF880850 */
  .extern CFD1MASK4CLR     /* 0xBF880854 */
  .extern CFD1MASK4SET     /* 0xBF880858 */
  .extern CFD1MASK4INV     /* 0xBF88085C */
  .extern CFD1FLTOBJ5      /* 0xBF880860 */
  .extern CFD1FLTOBJ5CLR   /* 0xBF880864 */
  .extern CFD1FLTOBJ5SET   /* 0xBF880868 */
  .extern CFD1FLTOBJ5INV   /* 0xBF88086C */
  .extern CFD1MASK5        /* 0xBF880870 */
  .extern CFD1MASK5CLR     /* 0xBF880874 */
  .extern CFD1MASK5SET     /* 0xBF880878 */
  .extern CFD1MASK5INV     /* 0xBF88087C */
  .extern CFD1FLTOBJ6      /* 0xBF880880 */
  .extern CFD1FLTOBJ6CLR   /* 0xBF880884 */
  .extern CFD1FLTOBJ6SET   /* 0xBF880888 */
  .extern CFD1FLTOBJ6INV   /* 0xBF88088C */
  .extern CFD1MASK6        /* 0xBF880890 */
  .extern CFD1MASK6CLR     /* 0xBF880894 */
  .extern CFD1MASK6SET     /* 0xBF880898 */
  .extern CFD1MASK6INV     /* 0xBF88089C */
  .extern CFD1FLTOBJ7      /* 0xBF8808A0 */
  .extern CFD1FLTOBJ7CLR   /* 0xBF8808A4 */
  .extern CFD1FLTOBJ7SET   /* 0xBF8808A8 */
  .extern CFD1FLTOBJ7INV   /* 0xBF8808AC */
  .extern CFD1MASK7        /* 0xBF8808B0 */
  .extern CFD1MASK7CLR     /* 0xBF8808B4 */
  .extern CFD1MASK7SET     /* 0xBF8808B8 */
  .extern CFD1FLTOBJ8      /* 0xBF8808C0 */
  .extern CFD1FLTOBJ8CLR   /* 0xBF8808C4 */
  .extern CFD1FLTOBJ8SET   /* 0xBF8808C8 */
  .extern CFD1FLTOBJ8INV   /* 0xBF8808CC */
  .extern CFD1MASK8        /* 0xBF8808D0 */
  .extern CFD1MASK8CLR     /* 0xBF8808D4 */
  .extern CFD1MASK8SET     /* 0xBF8808D8 */
  .extern CFD1MASK8INV     /* 0xBF8808DC */
  .extern CFD1FLTOBJ9      /* 0xBF8808E0 */
  .extern CFD1FLTOBJ9CLR   /* 0xBF8808E4 */
  .extern CFD1FLTOBJ9SET   /* 0xBF8808E8 */
  .extern CFD1FLTOBJ9INV   /* 0xBF8808EC */
  .extern CFD1MASK9        /* 0xBF8808F0 */
  .extern CFD1MASK9CLR     /* 0xBF8808F4 */
  .extern CFD1MASK9SET     /* 0xBF8808F8 */
  .extern CFD1MASK9INV     /* 0xBF8808FC */
  .extern CFD1FLTOBJ10     /* 0xBF880900 */
  .extern CFD1FLTOBJ10CLR  /* 0xBF880904 */
  .extern CFD1FLTOBJ10SET  /* 0xBF880908 */
  .extern CFD1FLTOBJ10INV  /* 0xBF88090C */
  .extern CFD1MASK10       /* 0xBF880910 */
  .extern CFD1MASK10CLR    /* 0xBF880914 */
  .extern CFD1MASK10SET    /* 0xBF880918 */
  .extern CFD1MASK10INV    /* 0xBF88091C */
  .extern CFD1FLTOBJ11     /* 0xBF880920 */
  .extern CFD1FLTOBJ11CLR  /* 0xBF880924 */
  .extern CFD1FLTOBJ11SET  /* 0xBF880928 */
  .extern CFD1FLTOBJ11INV  /* 0xBF88092C */
  .extern CFD1MASK11       /* 0xBF880930 */
  .extern CFD1MASK11CLR    /* 0xBF880934 */
  .extern CFD1MASK11SET    /* 0xBF880938 */
  .extern CFD1MASK11INV    /* 0xBF88093C */
  .extern CFD1FLTOBJ12     /* 0xBF880940 */
  .extern CFD1FLTOBJ12CLR  /* 0xBF880944 */
  .extern CFD1FLTOBJ12SET  /* 0xBF880948 */
  .extern CFD1FLTOBJ12INV  /* 0xBF88094C */
  .extern CFD1MASK12       /* 0xBF880950 */
  .extern CFD1MASK12CLR    /* 0xBF880954 */
  .extern CFD1MASK12SET    /* 0xBF880958 */
  .extern CFD1MASK12INV    /* 0xBF88095C */
  .extern CFD1FLTOBJ13     /* 0xBF880960 */
  .extern CFD1FLTOBJ13CLR  /* 0xBF880964 */
  .extern CFD1FLTOBJ13SET  /* 0xBF880968 */
  .extern CFD1FLTOBJ13INV  /* 0xBF88096C */
  .extern CFD1MASK13       /* 0xBF880970 */
  .extern CFD1MASK13CLR    /* 0xBF880974 */
  .extern CFD1MASK13SET    /* 0xBF880978 */
  .extern CFD1MASK13INV    /* 0xBF88097C */
  .extern CFD1FLTOBJ14     /* 0xBF880980 */
  .extern CFD1FLTOBJ14CLR  /* 0xBF880984 */
  .extern CFD1FLTOBJ14SET  /* 0xBF880988 */
  .extern CFD1FLTOBJ14INV  /* 0xBF88098C */
  .extern CFD1MASK14       /* 0xBF880990 */
  .extern CFD1MASK14CLR    /* 0xBF880994 */
  .extern CFD1MASK14SET    /* 0xBF880998 */
  .extern CFD1MASK14INV    /* 0xBF88099C */
  .extern CFD1FLTOBJ15     /* 0xBF8809A0 */
  .extern CFD1FLTOBJ15CLR  /* 0xBF8809A4 */
  .extern CFD1FLTOBJ15SET  /* 0xBF8809A8 */
  .extern CFD1FLTOBJ15INV  /* 0xBF8809AC */
  .extern CFD1MASK15       /* 0xBF8809B0 */
  .extern CFD1MASK15CLR    /* 0xBF8809B4 */
  .extern CFD1MASK15SET    /* 0xBF8809B8 */
  .extern CFD1MASK15INV    /* 0xBF8809BC */
  .extern CFD1FLTOBJ16     /* 0xBF8809C0 */
  .extern CFD1FLTOBJ16CLR  /* 0xBF8809C4 */
  .extern CFD1FLTOBJ16SET  /* 0xBF8809C8 */
  .extern CFD1FLTOBJ16INV  /* 0xBF8809CC */
  .extern CFD1MASK16       /* 0xBF8809D0 */
  .extern CFD1MASK16CLR    /* 0xBF8809D4 */
  .extern CFD1MASK16SET    /* 0xBF8809D8 */
  .extern CFD1MASK16INV    /* 0xBF8809DC */
  .extern CFD1FLTOBJ17     /* 0xBF8809E0 */
  .extern CFD1FLTOBJ17CLR  /* 0xBF8809E4 */
  .extern CFD1FLTOBJ17SET  /* 0xBF8809E8 */
  .extern CFD1FLTOBJ17INV  /* 0xBF8809EC */
  .extern CFD1MASK17       /* 0xBF8809F0 */
  .extern CFD1MASK17CLR    /* 0xBF8809F4 */
  .extern CFD1MASK17SET    /* 0xBF8809F8 */
  .extern CFD1MASK17INV    /* 0xBF8809FC */
  .extern CFD1FLTOBJ18     /* 0xBF880A00 */
  .extern CFD1FLTOBJ18CLR  /* 0xBF880A04 */
  .extern CFD1FLTOBJ18SET  /* 0xBF880A08 */
  .extern CFD1FLTOBJ18INV  /* 0xBF880A0C */
  .extern CFD1MASK18       /* 0xBF880A10 */
  .extern CFD1MASK18CLR    /* 0xBF880A14 */
  .extern CFD1MASK18SET    /* 0xBF880A18 */
  .extern CFD1MASK18INV    /* 0xBF880A1C */
  .extern CFD1FLTOBJ19     /* 0xBF880A20 */
  .extern CFD1FLTOBJ19CLR  /* 0xBF880A24 */
  .extern CFD1FLTOBJ19SET  /* 0xBF880A28 */
  .extern CFD1FLTOBJ19INV  /* 0xBF880A2C */
  .extern CFD1MASK19       /* 0xBF880A30 */
  .extern CFD1MASK19CLR    /* 0xBF880A34 */
  .extern CFD1MASK19SET    /* 0xBF880A38 */
  .extern CFD1MASK19INV    /* 0xBF880A3C */
  .extern CFD1FLTOBJ20     /* 0xBF880A40 */
  .extern CFD1FLTOBJ20CLR  /* 0xBF880A44 */
  .extern CFD1FLTOBJ20SET  /* 0xBF880A48 */
  .extern CFD1FLTOBJ20INV  /* 0xBF880A4C */
  .extern CFD1MASK20       /* 0xBF880A50 */
  .extern CFD1MASK20CLR    /* 0xBF880A54 */
  .extern CFD1MASK20SET    /* 0xBF880A58 */
  .extern CFD1MASK20INV    /* 0xBF880A5C */
  .extern CFD1FLTOBJ21     /* 0xBF880A60 */
  .extern CFD1FLTOBJ21CLR  /* 0xBF880A64 */
  .extern CFD1FLTOBJ21SET  /* 0xBF880A68 */
  .extern CFD1FLTOBJ21INV  /* 0xBF880A6C */
  .extern CFD1MASK21       /* 0xBF880A70 */
  .extern CFD1MASK21CLR    /* 0xBF880A74 */
  .extern CFD1MASK21SET    /* 0xBF880A78 */
  .extern CFD1MASK21INV    /* 0xBF880A7C */
  .extern CFD1FLTOBJ22     /* 0xBF880A80 */
  .extern CFD1FLTOBJ22CLR  /* 0xBF880A84 */
  .extern CFD1FLTOBJ22SET  /* 0xBF880A88 */
  .extern CFD1FLTOBJ22INV  /* 0xBF880A8C */
  .extern CFD1MASK22       /* 0xBF880A90 */
  .extern CFD1MASK22CLR    /* 0xBF880A94 */
  .extern CFD1MASK22SET    /* 0xBF880A98 */
  .extern CFD1MASK22INV    /* 0xBF880A9C */
  .extern CFD1FLTOBJ23     /* 0xBF880AA0 */
  .extern CFD1FLTOBJ23CLR  /* 0xBF880AA4 */
  .extern CFD1FLTOBJ23SET  /* 0xBF880AA8 */
  .extern CFD1FLTOBJ23INV  /* 0xBF880AAC */
  .extern CFD1MASK23       /* 0xBF880AB0 */
  .extern CFD1MASK23CLR    /* 0xBF880AB4 */
  .extern CFD1MASK23SET    /* 0xBF880AB8 */
  .extern CFD1MASK23INV    /* 0xBF880ABC */
  .extern CFD1FLTOBJ24     /* 0xBF880AC0 */
  .extern CFD1FLTOBJ24CLR  /* 0xBF880AC4 */
  .extern CFD1FLTOBJ24SET  /* 0xBF880AC8 */
  .extern CFD1FLTOBJ24INV  /* 0xBF880ACC */
  .extern CFD1MASK24       /* 0xBF880AD0 */
  .extern CFD1MASK24CLR    /* 0xBF880AD4 */
  .extern CFD1MASK24SET    /* 0xBF880AD8 */
  .extern CFD1MASK24INV    /* 0xBF880ADC */
  .extern CFD1FLTOBJ25     /* 0xBF880AE0 */
  .extern CFD1FLTOBJ25CLR  /* 0xBF880AE4 */
  .extern CFD1FLTOBJ25SET  /* 0xBF880AE8 */
  .extern CFD1FLTOBJ25INV  /* 0xBF880AEC */
  .extern CFD1MASK25       /* 0xBF880AF0 */
  .extern CFD1MASK25CLR    /* 0xBF880AF4 */
  .extern CFD1MASK25SET    /* 0xBF880AF8 */
  .extern CFD1MASK25INV    /* 0xBF880AFC */
  .extern CFD1FLTOBJ26     /* 0xBF880B00 */
  .extern CFD1FLTOBJ26CLR  /* 0xBF880B04 */
  .extern CFD1FLTOBJ26SET  /* 0xBF880B08 */
  .extern CFD1FLTOBJ26INV  /* 0xBF880B0C */
  .extern CFD1MASK26       /* 0xBF880B10 */
  .extern CFD1MASK26CLR    /* 0xBF880B14 */
  .extern CFD1MASK26SET    /* 0xBF880B18 */
  .extern CFD1MASK26INV    /* 0xBF880B1C */
  .extern CFD1FLTOBJ27     /* 0xBF880B20 */
  .extern CFD1FLTOBJ27CLR  /* 0xBF880B24 */
  .extern CFD1FLTOBJ27SET  /* 0xBF880B28 */
  .extern CFD1FLTOBJ27INV  /* 0xBF880B2C */
  .extern CFD1MASK27       /* 0xBF880B30 */
  .extern CFD1MASK27CLR    /* 0xBF880B34 */
  .extern CFD1MASK27SET    /* 0xBF880B38 */
  .extern CFD1MASK27INV    /* 0xBF880B3C */
  .extern CFD1FLTOBJ28     /* 0xBF880B40 */
  .extern CFD1FLTOBJ28CLR  /* 0xBF880B44 */
  .extern CFD1FLTOBJ28SET  /* 0xBF880B48 */
  .extern CFD1FLTOBJ28INV  /* 0xBF880B4C */
  .extern CFD1MASK28       /* 0xBF880B50 */
  .extern CFD1MASK28CLR    /* 0xBF880B54 */
  .extern CFD1MASK28SET    /* 0xBF880B58 */
  .extern CFD1MASK28INV    /* 0xBF880B5C */
  .extern CFD1FLTOBJ29     /* 0xBF880B60 */
  .extern CFD1FLTOBJ29CLR  /* 0xBF880B64 */
  .extern CFD1FLTOBJ29SET  /* 0xBF880B68 */
  .extern CFD1FLTOBJ29INV  /* 0xBF880B6C */
  .extern CFD1MASK29       /* 0xBF880B70 */
  .extern CFD1MASK29CLR    /* 0xBF880B74 */
  .extern CFD1MASK29SET    /* 0xBF880B78 */
  .extern CFD1MASK29INV    /* 0xBF880B7C */
  .extern CFD1FLTOBJ30     /* 0xBF880B80 */
  .extern CFD1FLTOBJ30CLR  /* 0xBF880B84 */
  .extern CFD1FLTOBJ30SET  /* 0xBF880B88 */
  .extern CFD1FLTOBJ30INV  /* 0xBF880B8C */
  .extern CFD1MASK30       /* 0xBF880B90 */
  .extern CFD1MASK30CLR    /* 0xBF880B94 */
  .extern CFD1MASK30SET    /* 0xBF880B98 */
  .extern CFD1MASK30INV    /* 0xBF880B9C */
  .extern CFD1FLTOBJ31     /* 0xBF880BA0 */
  .extern CFD1FLTOBJ31CLR  /* 0xBF880BA4 */
  .extern CFD1FLTOBJ31SET  /* 0xBF880BA8 */
  .extern CFD1FLTOBJ31INV  /* 0xBF880BAC */
  .extern CFD1MASK31       /* 0xBF880BB0 */
  .extern CFD1MASK31CLR    /* 0xBF880BB4 */
  .extern CFD1MASK31SET    /* 0xBF880BB8 */
  .extern CFD1MASK31INV    /* 0xBF880BBC */
  .extern ADCCON1          /* 0xBF887000 */
  .extern ADCCON1CLR       /* 0xBF887004 */
  .extern ADCCON1SET       /* 0xBF887008 */
  .extern ADCCON1INV       /* 0xBF88700C */
  .extern ADCCON2          /* 0xBF887010 */
  .extern ADCCON2CLR       /* 0xBF887014 */
  .extern ADCCON2SET       /* 0xBF887018 */
  .extern ADCCON2INV       /* 0xBF88701C */
  .extern ADCCON3          /* 0xBF887020 */
  .extern ADCCON3CLR       /* 0xBF887024 */
  .extern ADCCON3SET       /* 0xBF887028 */
  .extern ADCCON3INV       /* 0xBF88702C */
  .extern ADCTRGMODE       /* 0xBF887030 */
  .extern ADCTRGMODECLR    /* 0xBF887034 */
  .extern ADCTRGMODESET    /* 0xBF887038 */
  .extern ADCTRGMODEINV    /* 0xBF88703C */
  .extern ADCIMCON1        /* 0xBF887040 */
  .extern ADCIMCON1CLR     /* 0xBF887044 */
  .extern ADCIMCON1SET     /* 0xBF887048 */
  .extern ADCIMCON1INV     /* 0xBF88704C */
  .extern ADCIMCON2        /* 0xBF887050 */
  .extern ADCIMCON2CLR     /* 0xBF887054 */
  .extern ADCIMCON2SET     /* 0xBF887058 */
  .extern ADCIMCON2INV     /* 0xBF88705C */
  .extern ADCIMCON3        /* 0xBF887060 */
  .extern ADCIMCON3CLR     /* 0xBF887064 */
  .extern ADCIMCON3SET     /* 0xBF887068 */
  .extern ADCIMCON3INV     /* 0xBF88706C */
  .extern ADCIMCON4        /* 0xBF887070 */
  .extern ADCIMCON4CLR     /* 0xBF887074 */
  .extern ADCIMCON4SET     /* 0xBF887078 */
  .extern ADCIMCON4INV     /* 0xBF88707C */
  .extern ADCGIRQEN1       /* 0xBF887080 */
  .extern ADCGIRQEN1CLR    /* 0xBF887084 */
  .extern ADCGIRQEN1SET    /* 0xBF887088 */
  .extern ADCGIRQEN1INV    /* 0xBF88708C */
  .extern ADCGIRQEN2       /* 0xBF887090 */
  .extern ADCGIRQEN2CLR    /* 0xBF887094 */
  .extern ADCGIRQEN2SET    /* 0xBF887098 */
  .extern ADCGIRQEN2INV    /* 0xBF88709C */
  .extern ADCCSS1          /* 0xBF8870A0 */
  .extern ADCCSS1CLR       /* 0xBF8870A4 */
  .extern ADCCSS1SET       /* 0xBF8870A8 */
  .extern ADCCSS1INV       /* 0xBF8870AC */
  .extern ADCCSS2          /* 0xBF8870B0 */
  .extern ADCCSS2CLR       /* 0xBF8870B4 */
  .extern ADCCSS2SET       /* 0xBF8870B8 */
  .extern ADCCSS2INV       /* 0xBF8870BC */
  .extern ADCDSTAT1        /* 0xBF8870C0 */
  .extern ADCDSTAT1CLR     /* 0xBF8870C4 */
  .extern ADCDSTAT1SET     /* 0xBF8870C8 */
  .extern ADCDSTAT1INV     /* 0xBF8870CC */
  .extern ADCDSTAT2        /* 0xBF8870D0 */
  .extern ADCDSTAT2CLR     /* 0xBF8870D4 */
  .extern ADCDSTAT2SET     /* 0xBF8870D8 */
  .extern ADCDSTAT2INV     /* 0xBF8870DC */
  .extern ADCCMPEN1        /* 0xBF8870E0 */
  .extern ADCCMPEN1CLR     /* 0xBF8870E4 */
  .extern ADCCMPEN1SET     /* 0xBF8870E8 */
  .extern ADCCMPEN1INV     /* 0xBF8870EC */
  .extern ADCCMP1          /* 0xBF8870F0 */
  .extern ADCCMP1CLR       /* 0xBF8870F4 */
  .extern ADCCMP1SET       /* 0xBF8870F8 */
  .extern ADCCMP1INV       /* 0xBF8870FC */
  .extern ADCCMPEN2        /* 0xBF887100 */
  .extern ADCCMPEN2CLR     /* 0xBF887104 */
  .extern ADCCMPEN2SET     /* 0xBF887108 */
  .extern ADCCMPEN2INV     /* 0xBF88710C */
  .extern ADCCMP2          /* 0xBF887110 */
  .extern ADCCMP2CLR       /* 0xBF887114 */
  .extern ADCCMP2SET       /* 0xBF887118 */
  .extern ADCCMP2INV       /* 0xBF88711C */
  .extern ADCCMPEN3        /* 0xBF887120 */
  .extern ADCCMPEN3CLR     /* 0xBF887124 */
  .extern ADCCMPEN3SET     /* 0xBF887128 */
  .extern ADCCMPEN3INV     /* 0xBF88712C */
  .extern ADCCMP3          /* 0xBF887130 */
  .extern ADCCMP3CLR       /* 0xBF887134 */
  .extern ADCCMP3SET       /* 0xBF887138 */
  .extern ADCCMP3INV       /* 0xBF88713C */
  .extern ADCCMPEN4        /* 0xBF887140 */
  .extern ADCCMPEN4CLR     /* 0xBF887144 */
  .extern ADCCMPEN4SET     /* 0xBF887148 */
  .extern ADCCMPEN4INV     /* 0xBF88714C */
  .extern ADCCMP4          /* 0xBF887150 */
  .extern ADCCMP4CLR       /* 0xBF887154 */
  .extern ADCCMP4SET       /* 0xBF887158 */
  .extern ADCCMP4INV       /* 0xBF88715C */
  .extern ADCFLTR1         /* 0xBF8871A0 */
  .extern ADCFLTR1CLR      /* 0xBF8871A4 */
  .extern ADCFLTR1SET      /* 0xBF8871A8 */
  .extern ADCFLTR1INV      /* 0xBF8871AC */
  .extern ADCFLTR2         /* 0xBF8871B0 */
  .extern ADCFLTR2CLR      /* 0xBF8871B4 */
  .extern ADCFLTR2SET      /* 0xBF8871B8 */
  .extern ADCFLTR2INV      /* 0xBF8871BC */
  .extern ADCFLTR3         /* 0xBF8871C0 */
  .extern ADCFLTR3CLR      /* 0xBF8871C4 */
  .extern ADCFLTR3SET      /* 0xBF8871C8 */
  .extern ADCFLTR3INV      /* 0xBF8871CC */
  .extern ADCFLTR4         /* 0xBF8871D0 */
  .extern ADCFLTR4CLR      /* 0xBF8871D4 */
  .extern ADCFLTR4SET      /* 0xBF8871D8 */
  .extern ADCFLTR4INV      /* 0xBF8871DC */
  .extern ADCTRG1          /* 0xBF887200 */
  .extern ADCTRG1CLR       /* 0xBF887204 */
  .extern ADCTRG1SET       /* 0xBF887208 */
  .extern ADCTRG1INV       /* 0xBF88720C */
  .extern ADCTRG2          /* 0xBF887210 */
  .extern ADCTRG2CLR       /* 0xBF887214 */
  .extern ADCTRG2SET       /* 0xBF887218 */
  .extern ADCTRG2INV       /* 0xBF88721C */
  .extern ADCTRG3          /* 0xBF887220 */
  .extern ADCTRG3CLR       /* 0xBF887224 */
  .extern ADCTRG3SET       /* 0xBF887228 */
  .extern ADCTRG3INV       /* 0xBF88722C */
  .extern ADCTRG4          /* 0xBF887230 */
  .extern ADCTRG4CLR       /* 0xBF887234 */
  .extern ADCTRG4SET       /* 0xBF887238 */
  .extern ADCTRG4INV       /* 0xBF88723C */
  .extern ADCTRG5          /* 0xBF887240 */
  .extern ADCTRG5CLR       /* 0xBF887244 */
  .extern ADCTRG5SET       /* 0xBF887248 */
  .extern ADCTRG5INV       /* 0xBF88724C */
  .extern ADCTRG7          /* 0xBF887260 */
  .extern ADCTRG7CLR       /* 0xBF887264 */
  .extern ADCTRG7SET       /* 0xBF887268 */
  .extern ADCTRG7INV       /* 0xBF88726C */
  .extern ADCCMPCON1       /* 0xBF887280 */
  .extern ADCCMPCON1CLR    /* 0xBF887284 */
  .extern ADCCMPCON1SET    /* 0xBF887288 */
  .extern ADCCMPCON1INV    /* 0xBF88728C */
  .extern ADCCMPCON2       /* 0xBF887290 */
  .extern ADCCMPCON2CLR    /* 0xBF887294 */
  .extern ADCCMPCON2SET    /* 0xBF887298 */
  .extern ADCCMPCON2INV    /* 0xBF88729C */
  .extern ADCCMPCON3       /* 0xBF8872A0 */
  .extern ADCCMPCON3CLR    /* 0xBF8872A4 */
  .extern ADCCMPCON3SET    /* 0xBF8872A8 */
  .extern ADCCMPCON3INV    /* 0xBF8872AC */
  .extern ADCCMPCON4       /* 0xBF8872B0 */
  .extern ADCCMPCON4CLR    /* 0xBF8872B4 */
  .extern ADCCMPCON4SET    /* 0xBF8872B8 */
  .extern ADCCMPCON4INV    /* 0xBF8872BC */
  .extern ADCBASE          /* 0xBF887300 */
  .extern ADCBASECLR       /* 0xBF887304 */
  .extern ADCBASESET       /* 0xBF887308 */
  .extern ADCBASEINV       /* 0xBF88730C */
  .extern ADCDSTAT         /* 0xBF887310 */
  .extern ADCDSTATCLR      /* 0xBF887314 */
  .extern ADCDSTATSET      /* 0xBF887318 */
  .extern ADCDSTATINV      /* 0xBF88731C */
  .extern ADCCNTB          /* 0xBF887320 */
  .extern ADCCNTBCLR       /* 0xBF887324 */
  .extern ADCCNTBSET       /* 0xBF887328 */
  .extern ADCCNTBINV       /* 0xBF88732C */
  .extern ADCDMAB          /* 0xBF887330 */
  .extern ADCDMABCLR       /* 0xBF887334 */
  .extern ADCDMABSET       /* 0xBF887338 */
  .extern ADCDMABINV       /* 0xBF88733C */
  .extern ADCTRGSNS        /* 0xBF887340 */
  .extern ADCTRGSNSCLR     /* 0xBF887344 */
  .extern ADCTRGSNSSET     /* 0xBF887348 */
  .extern ADCTRGSNSINV     /* 0xBF88734C */
  .extern ADC0TIME         /* 0xBF887350 */
  .extern ADC0TIMECLR      /* 0xBF887354 */
  .extern ADC0TIMESET      /* 0xBF887358 */
  .extern ADC0TIMEINV      /* 0xBF88735C */
  .extern ADC1TIME         /* 0xBF887360 */
  .extern ADC1TIMECLR      /* 0xBF887364 */
  .extern ADC1TIMESET      /* 0xBF887368 */
  .extern ADC1TIMEINV      /* 0xBF88736C */
  .extern ADC2TIME         /* 0xBF887370 */
  .extern ADC2TIMECLR      /* 0xBF887374 */
  .extern ADC2TIMESET      /* 0xBF887378 */
  .extern ADC2TIMEINV      /* 0xBF88737C */
  .extern ADC3TIME         /* 0xBF887380 */
  .extern ADC3TIMECLR      /* 0xBF887384 */
  .extern ADC3TIMESET      /* 0xBF887388 */
  .extern ADC3TIMEINV      /* 0xBF88738C */
  .extern ADC4TIME         /* 0xBF887390 */
  .extern ADC4TIMECLR      /* 0xBF887394 */
  .extern ADC4TIMESET      /* 0xBF887398 */
  .extern ADC4TIMEINV      /* 0xBF88739C */
  .extern ADC5TIME         /* 0xBF8873A0 */
  .extern ADC5TIMECLR      /* 0xBF8873A4 */
  .extern ADC5TIMESET      /* 0xBF8873A8 */
  .extern ADC5TIMEINV      /* 0xBF8873AC */
  .extern ADCEIEN1         /* 0xBF8873C0 */
  .extern ADCEIEN1CLR      /* 0xBF8873C4 */
  .extern ADCEIEN1SET      /* 0xBF8873C8 */
  .extern ADCEIEN1INV      /* 0xBF8873CC */
  .extern ADCEIEN2         /* 0xBF8873D0 */
  .extern ADCEIEN2CLR      /* 0xBF8873D4 */
  .extern ADCEIEN2SET      /* 0xBF8873D8 */
  .extern ADCEIEN2INV      /* 0xBF8873DC */
  .extern ADCEISTAT1       /* 0xBF8873E0 */
  .extern ADCEISTAT1CLR    /* 0xBF8873E4 */
  .extern ADCEISTAT1SET    /* 0xBF8873E8 */
  .extern ADCEISTAT1INV    /* 0xBF8873EC */
  .extern ADCEISTAT2       /* 0xBF8873F0 */
  .extern ADCEISTAT2CLR    /* 0xBF8873F4 */
  .extern ADCEISTAT2SET    /* 0xBF8873F8 */
  .extern ADCEISTAT2INV    /* 0xBF8873FC */
  .extern ADCANCON         /* 0xBF887400 */
  .extern ADCANCONCLR      /* 0xBF887404 */
  .extern ADCANCONSET      /* 0xBF887408 */
  .extern ADCANCONINV      /* 0xBF88740C */
  .extern ADCDATA0         /* 0xBF887600 */
  .extern ADCDATA0CLR      /* 0xBF887604 */
  .extern ADCDATA0SET      /* 0xBF887608 */
  .extern ADCDATA0INV      /* 0xBF88760C */
  .extern ADCDATA1         /* 0xBF887610 */
