Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
#define _IFS3_AD1D17IF_POSITION                  0x0000001B
#define _IFS3_AD1D17IF_MASK                      0x08000000
#define _IFS3_AD1D17IF_LENGTH                    0x00000001

#define _IFS3_AD1D18IF_POSITION                  0x0000001C
#define _IFS3_AD1D18IF_MASK                      0x10000000
#define _IFS3_AD1D18IF_LENGTH                    0x00000001

#define _IFS3_AD1D19IF_POSITION                  0x0000001D
#define _IFS3_AD1D19IF_MASK                      0x20000000
#define _IFS3_AD1D19IF_LENGTH                    0x00000001

#define _IFS3_w_POSITION                         0x00000000
#define _IFS3_w_MASK                             0xFFFFFFFF
#define _IFS3_w_LENGTH                           0x00000020

#define _IFS4_AD1D24IF_POSITION                  0x00000002
#define _IFS4_AD1D24IF_MASK                      0x00000004
#define _IFS4_AD1D24IF_LENGTH                    0x00000001

#define _IFS4_AD1D25IF_POSITION                  0x00000003
#define _IFS4_AD1D25IF_MASK                      0x00000008
#define _IFS4_AD1D25IF_LENGTH                    0x00000001

#define _IFS4_AD1D26IF_POSITION                  0x00000004
#define _IFS4_AD1D26IF_MASK                      0x00000010
#define _IFS4_AD1D26IF_LENGTH                    0x00000001

#define _IFS4_AD1D27IF_POSITION                  0x00000005
#define _IFS4_AD1D27IF_MASK                      0x00000020
#define _IFS4_AD1D27IF_LENGTH                    0x00000001

#define _IFS4_AD1D40IF_POSITION                  0x00000012
#define _IFS4_AD1D40IF_MASK                      0x00040000
#define _IFS4_AD1D40IF_LENGTH                    0x00000001

#define _IFS4_AD1D41IF_POSITION                  0x00000013
#define _IFS4_AD1D41IF_MASK                      0x00080000
#define _IFS4_AD1D41IF_LENGTH                    0x00000001

#define _IFS4_AD1D46IF_POSITION                  0x00000018
#define _IFS4_AD1D46IF_MASK                      0x01000000
#define _IFS4_AD1D46IF_LENGTH                    0x00000001

#define _IFS4_AD1D47IF_POSITION                  0x00000019
#define _IFS4_AD1D47IF_MASK                      0x02000000
#define _IFS4_AD1D47IF_LENGTH                    0x00000001

#define _IFS4_AD1D48IF_POSITION                  0x0000001A
#define _IFS4_AD1D48IF_MASK                      0x04000000
#define _IFS4_AD1D48IF_LENGTH                    0x00000001

#define _IFS4_AD1D49IF_POSITION                  0x0000001B
#define _IFS4_AD1D49IF_MASK                      0x08000000
#define _IFS4_AD1D49IF_LENGTH                    0x00000001

#define _IFS4_AD1D50IF_POSITION                  0x0000001C
#define _IFS4_AD1D50IF_MASK                      0x10000000
#define _IFS4_AD1D50IF_LENGTH                    0x00000001

#define _IFS4_AD1D51IF_POSITION                  0x0000001D
#define _IFS4_AD1D51IF_MASK                      0x20000000
#define _IFS4_AD1D51IF_LENGTH                    0x00000001

#define _IFS4_AD1D52IF_POSITION                  0x0000001E
#define _IFS4_AD1D52IF_MASK                      0x40000000
#define _IFS4_AD1D52IF_LENGTH                    0x00000001

#define _IFS4_AD1D53IF_POSITION                  0x0000001F
#define _IFS4_AD1D53IF_MASK                      0x80000000
#define _IFS4_AD1D53IF_LENGTH                    0x00000001

#define _IFS4_w_POSITION                         0x00000000
#define _IFS4_w_MASK                             0xFFFFFFFF
#define _IFS4_w_LENGTH                           0x00000020

#define _IFS5_CMP3IF_POSITION                    0x00000000
#define _IFS5_CMP3IF_MASK                        0x00000001
#define _IFS5_CMP3IF_LENGTH                      0x00000001

#define _IFS5_CMP4IF_POSITION                    0x00000001
#define _IFS5_CMP4IF_MASK                        0x00000002
#define _IFS5_CMP4IF_LENGTH                      0x00000001

#define _IFS5_CMP5IF_POSITION                    0x00000002
#define _IFS5_CMP5IF_MASK                        0x00000004
#define _IFS5_CMP5IF_LENGTH                      0x00000001

#define _IFS5_CAN1IF_POSITION                    0x00000007
#define _IFS5_CAN1IF_MASK                        0x00000080
#define _IFS5_CAN1IF_LENGTH                      0x00000001

#define _IFS5_QEI1IF_POSITION                    0x00000009
#define _IFS5_QEI1IF_MASK                        0x00000200
#define _IFS5_QEI1IF_LENGTH                      0x00000001

#define _IFS5_QEI2IF_POSITION                    0x0000000A
#define _IFS5_QEI2IF_MASK                        0x00000400
#define _IFS5_QEI2IF_LENGTH                      0x00000001

#define _IFS5_PWMPEVTIF_POSITION                 0x0000000B
#define _IFS5_PWMPEVTIF_MASK                     0x00000800
#define _IFS5_PWMPEVTIF_LENGTH                   0x00000001

#define _IFS5_PWMSEVTIF_POSITION                 0x0000000C
#define _IFS5_PWMSEVTIF_MASK                     0x00001000
#define _IFS5_PWMSEVTIF_LENGTH                   0x00000001

#define _IFS5_PWM1IF_POSITION                    0x0000000D
#define _IFS5_PWM1IF_MASK                        0x00002000
#define _IFS5_PWM1IF_LENGTH                      0x00000001

#define _IFS5_PWM2IF_POSITION                    0x0000000E
#define _IFS5_PWM2IF_MASK                        0x00004000
#define _IFS5_PWM2IF_LENGTH                      0x00000001

#define _IFS5_PWM3IF_POSITION                    0x0000000F
#define _IFS5_PWM3IF_MASK                        0x00008000
#define _IFS5_PWM3IF_LENGTH                      0x00000001

#define _IFS5_PWM4IF_POSITION                    0x00000010
#define _IFS5_PWM4IF_MASK                        0x00010000
#define _IFS5_PWM4IF_LENGTH                      0x00000001

#define _IFS5_PWM5IF_POSITION                    0x00000011
#define _IFS5_PWM5IF_MASK                        0x00020000
#define _IFS5_PWM5IF_LENGTH                      0x00000001

#define _IFS5_PWM6IF_POSITION                    0x00000012
#define _IFS5_PWM6IF_MASK                        0x00040000
#define _IFS5_PWM6IF_LENGTH                      0x00000001

#define _IFS5_DMA4IF_POSITION                    0x00000016
#define _IFS5_DMA4IF_MASK                        0x00400000
#define _IFS5_DMA4IF_LENGTH                      0x00000001

#define _IFS5_DMA5IF_POSITION                    0x00000017
#define _IFS5_DMA5IF_MASK                        0x00800000
#define _IFS5_DMA5IF_LENGTH                      0x00000001

#define _IFS5_DMA6IF_POSITION                    0x00000018
#define _IFS5_DMA6IF_MASK                        0x01000000
#define _IFS5_DMA6IF_LENGTH                      0x00000001

#define _IFS5_DMA7IF_POSITION                    0x00000019
#define _IFS5_DMA7IF_MASK                        0x02000000
#define _IFS5_DMA7IF_LENGTH                      0x00000001

#define _IFS5_QEI3IF_POSITION                    0x0000001D
#define _IFS5_QEI3IF_MASK                        0x20000000
#define _IFS5_QEI3IF_LENGTH                      0x00000001

