Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
#define _QEI2STAT_PCHEQIRQ_POSITION              0x0000000D
#define _QEI2STAT_PCHEQIRQ_MASK                  0x00002000
#define _QEI2STAT_PCHEQIRQ_LENGTH                0x00000001

#define _POS2CNT_POSCNT_POSITION                 0x00000000
#define _POS2CNT_POSCNT_MASK                     0xFFFFFFFF
#define _POS2CNT_POSCNT_LENGTH                   0x00000020

#define _POS2HLD_POSHLD_POSITION                 0x00000000
#define _POS2HLD_POSHLD_MASK                     0xFFFFFFFF
#define _POS2HLD_POSHLD_LENGTH                   0x00000020

#define _VEL2CNT_VELCNT_POSITION                 0x00000000
#define _VEL2CNT_VELCNT_MASK                     0xFFFFFFFF
#define _VEL2CNT_VELCNT_LENGTH                   0x00000020

#define _VEL2HLD_VELHLD_POSITION                 0x00000000
#define _VEL2HLD_VELHLD_MASK                     0xFFFFFFFF
#define _VEL2HLD_VELHLD_LENGTH                   0x00000020

#define _INT2TMR_INTTMR_POSITION                 0x00000000
#define _INT2TMR_INTTMR_MASK                     0xFFFFFFFF
#define _INT2TMR_INTTMR_LENGTH                   0x00000020

#define _INT2HLD_INTHLD_POSITION                 0x00000000
#define _INT2HLD_INTHLD_MASK                     0xFFFFFFFF
#define _INT2HLD_INTHLD_LENGTH                   0x00000020

#define _INDX2CNT_INDXCNT_POSITION               0x00000000
#define _INDX2CNT_INDXCNT_MASK                   0xFFFFFFFF
#define _INDX2CNT_INDXCNT_LENGTH                 0x00000020

#define _INDX2HLD_INDXHLD_POSITION               0x00000000
#define _INDX2HLD_INDXHLD_MASK                   0xFFFFFFFF
#define _INDX2HLD_INDXHLD_LENGTH                 0x00000020

#define _QEI2ICC_QEIICC_POSITION                 0x00000000
#define _QEI2ICC_QEIICC_MASK                     0xFFFFFFFF
#define _QEI2ICC_QEIICC_LENGTH                   0x00000020

#define _QEI2CMPL_QEICMPL_POSITION               0x00000000
#define _QEI2CMPL_QEICMPL_MASK                   0xFFFFFFFF
#define _QEI2CMPL_QEICMPL_LENGTH                 0x00000020

#define _QEI3CON_CCM_POSITION                    0x00000000
#define _QEI3CON_CCM_MASK                        0x00000003
#define _QEI3CON_CCM_LENGTH                      0x00000002

#define _QEI3CON_GATEN_POSITION                  0x00000002
#define _QEI3CON_GATEN_MASK                      0x00000004
#define _QEI3CON_GATEN_LENGTH                    0x00000001

#define _QEI3CON_CNTPOL_POSITION                 0x00000003
#define _QEI3CON_CNTPOL_MASK                     0x00000008
#define _QEI3CON_CNTPOL_LENGTH                   0x00000001

#define _QEI3CON_INTDIV_POSITION                 0x00000004
#define _QEI3CON_INTDIV_MASK                     0x00000070
#define _QEI3CON_INTDIV_LENGTH                   0x00000003

#define _QEI3CON_IMV_POSITION                    0x00000008
#define _QEI3CON_IMV_MASK                        0x00000300
#define _QEI3CON_IMV_LENGTH                      0x00000002

#define _QEI3CON_PIMOD_POSITION                  0x0000000A
#define _QEI3CON_PIMOD_MASK                      0x00001C00
#define _QEI3CON_PIMOD_LENGTH                    0x00000003

#define _QEI3CON_QEISIDL_POSITION                0x0000000D
#define _QEI3CON_QEISIDL_MASK                    0x00002000
#define _QEI3CON_QEISIDL_LENGTH                  0x00000001

#define _QEI3CON_QEIEN_POSITION                  0x0000000F
#define _QEI3CON_QEIEN_MASK                      0x00008000
#define _QEI3CON_QEIEN_LENGTH                    0x00000001

#define _QEI3IOC_QEA_POSITION                    0x00000000
#define _QEI3IOC_QEA_MASK                        0x00000001
#define _QEI3IOC_QEA_LENGTH                      0x00000001

#define _QEI3IOC_QEB_POSITION                    0x00000001
#define _QEI3IOC_QEB_MASK                        0x00000002
#define _QEI3IOC_QEB_LENGTH                      0x00000001

#define _QEI3IOC_INDEX_POSITION                  0x00000002
#define _QEI3IOC_INDEX_MASK                      0x00000004
#define _QEI3IOC_INDEX_LENGTH                    0x00000001

#define _QEI3IOC_HOME_POSITION                   0x00000003
#define _QEI3IOC_HOME_MASK                       0x00000008
#define _QEI3IOC_HOME_LENGTH                     0x00000001

#define _QEI3IOC_QEAPOL_POSITION                 0x00000004
#define _QEI3IOC_QEAPOL_MASK                     0x00000010
#define _QEI3IOC_QEAPOL_LENGTH                   0x00000001

#define _QEI3IOC_QEBPOL_POSITION                 0x00000005
#define _QEI3IOC_QEBPOL_MASK                     0x00000020
#define _QEI3IOC_QEBPOL_LENGTH                   0x00000001

#define _QEI3IOC_IDXPOL_POSITION                 0x00000006
#define _QEI3IOC_IDXPOL_MASK                     0x00000040
#define _QEI3IOC_IDXPOL_LENGTH                   0x00000001

#define _QEI3IOC_HOMPOL_POSITION                 0x00000007
#define _QEI3IOC_HOMPOL_MASK                     0x00000080
#define _QEI3IOC_HOMPOL_LENGTH                   0x00000001

#define _QEI3IOC_SWPAB_POSITION                  0x00000008
#define _QEI3IOC_SWPAB_MASK                      0x00000100
#define _QEI3IOC_SWPAB_LENGTH                    0x00000001

#define _QEI3IOC_OUTFNC_POSITION                 0x00000009
#define _QEI3IOC_OUTFNC_MASK                     0x00000600
#define _QEI3IOC_OUTFNC_LENGTH                   0x00000002

#define _QEI3IOC_QFDIV_POSITION                  0x0000000B
#define _QEI3IOC_QFDIV_MASK                      0x00003800
#define _QEI3IOC_QFDIV_LENGTH                    0x00000003

#define _QEI3IOC_FLTREN_POSITION                 0x0000000E
#define _QEI3IOC_FLTREN_MASK                     0x00004000
#define _QEI3IOC_FLTREN_LENGTH                   0x00000001

#define _QEI3IOC_QCAPEN_POSITION                 0x0000000F
#define _QEI3IOC_QCAPEN_MASK                     0x00008000
#define _QEI3IOC_QCAPEN_LENGTH                   0x00000001

#define _QEI3IOC_HCAPEN_POSITION                 0x00000010
#define _QEI3IOC_HCAPEN_MASK                     0x00010000
#define _QEI3IOC_HCAPEN_LENGTH                   0x00000001

#define _QEI3STAT_IDXIEN_POSITION                0x00000000
#define _QEI3STAT_IDXIEN_MASK                    0x00000001
#define _QEI3STAT_IDXIEN_LENGTH                  0x00000001

#define _QEI3STAT_IDXIRQ_POSITION                0x00000001
#define _QEI3STAT_IDXIRQ_MASK                    0x00000002
#define _QEI3STAT_IDXIRQ_LENGTH                  0x00000001

#define _QEI3STAT_HOMIEN_POSITION                0x00000002
#define _QEI3STAT_HOMIEN_MASK                    0x00000004
#define _QEI3STAT_HOMIEN_LENGTH                  0x00000001

#define _QEI3STAT_HOMIRQ_POSITION                0x00000003
#define _QEI3STAT_HOMIRQ_MASK                    0x00000008
#define _QEI3STAT_HOMIRQ_LENGTH                  0x00000001

#define _QEI3STAT_VELOVIEN_POSITION              0x00000004
#define _QEI3STAT_VELOVIEN_MASK                  0x00000010
#define _QEI3STAT_VELOVIEN_LENGTH                0x00000001

#define _QEI3STAT_VELOVIRQ_POSITION              0x00000005
#define _QEI3STAT_VELOVIRQ_MASK                  0x00000020
#define _QEI3STAT_VELOVIRQ_LENGTH                0x00000001

#define _QEI3STAT_PCIIEN_POSITION                0x00000006
#define _QEI3STAT_PCIIEN_MASK                    0x00000040
#define _QEI3STAT_PCIIEN_LENGTH                  0x00000001

#define _QEI3STAT_PCIIRQ_POSITION                0x00000007
#define _QEI3STAT_PCIIRQ_MASK                    0x00000080
#define _QEI3STAT_PCIIRQ_LENGTH                  0x00000001

