Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
#define _QEI3STAT_POSOVIEN_POSITION              0x00000008
#define _QEI3STAT_POSOVIEN_MASK                  0x00000100
#define _QEI3STAT_POSOVIEN_LENGTH                0x00000001

#define _QEI3STAT_POSOVIRQ_POSITION              0x00000009
#define _QEI3STAT_POSOVIRQ_MASK                  0x00000200
#define _QEI3STAT_POSOVIRQ_LENGTH                0x00000001

#define _QEI3STAT_PCLEQIEN_POSITION              0x0000000A
#define _QEI3STAT_PCLEQIEN_MASK                  0x00000400
#define _QEI3STAT_PCLEQIEN_LENGTH                0x00000001

#define _QEI3STAT_PCLEQIRQ_POSITION              0x0000000B
#define _QEI3STAT_PCLEQIRQ_MASK                  0x00000800
#define _QEI3STAT_PCLEQIRQ_LENGTH                0x00000001

#define _QEI3STAT_PCHEQIEN_POSITION              0x0000000C
#define _QEI3STAT_PCHEQIEN_MASK                  0x00001000
#define _QEI3STAT_PCHEQIEN_LENGTH                0x00000001

#define _QEI3STAT_PCHEQIRQ_POSITION              0x0000000D
#define _QEI3STAT_PCHEQIRQ_MASK                  0x00002000
#define _QEI3STAT_PCHEQIRQ_LENGTH                0x00000001

#define _POS3CNT_POSCNT_POSITION                 0x00000000
#define _POS3CNT_POSCNT_MASK                     0xFFFFFFFF
#define _POS3CNT_POSCNT_LENGTH                   0x00000020

#define _POS3HLD_POSHLD_POSITION                 0x00000000
#define _POS3HLD_POSHLD_MASK                     0xFFFFFFFF
#define _POS3HLD_POSHLD_LENGTH                   0x00000020

#define _VEL3CNT_VELCNT_POSITION                 0x00000000
#define _VEL3CNT_VELCNT_MASK                     0xFFFFFFFF
#define _VEL3CNT_VELCNT_LENGTH                   0x00000020

#define _VEL3HLD_VELHLD_POSITION                 0x00000000
#define _VEL3HLD_VELHLD_MASK                     0xFFFFFFFF
#define _VEL3HLD_VELHLD_LENGTH                   0x00000020

#define _INT3TMR_INTTMR_POSITION                 0x00000000
#define _INT3TMR_INTTMR_MASK                     0xFFFFFFFF
#define _INT3TMR_INTTMR_LENGTH                   0x00000020

#define _INT3HLD_INTHLD_POSITION                 0x00000000
#define _INT3HLD_INTHLD_MASK                     0xFFFFFFFF
#define _INT3HLD_INTHLD_LENGTH                   0x00000020

#define _INDX3CNT_INDXCNT_POSITION               0x00000000
#define _INDX3CNT_INDXCNT_MASK                   0xFFFFFFFF
#define _INDX3CNT_INDXCNT_LENGTH                 0x00000020

#define _INDX3HLD_INDXHLD_POSITION               0x00000000
#define _INDX3HLD_INDXHLD_MASK                   0xFFFFFFFF
#define _INDX3HLD_INDXHLD_LENGTH                 0x00000020

#define _QEI3ICC_QEIICC_POSITION                 0x00000000
#define _QEI3ICC_QEIICC_MASK                     0xFFFFFFFF
#define _QEI3ICC_QEIICC_LENGTH                   0x00000020

#define _QEI3CMPL_QEICMPL_POSITION               0x00000000
#define _QEI3CMPL_QEICMPL_MASK                   0xFFFFFFFF
#define _QEI3CMPL_QEICMPL_LENGTH                 0x00000020

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_C3OUT_POSITION                   0x00000002
#define _CMSTAT_C3OUT_MASK                       0x00000004
#define _CMSTAT_C3OUT_LENGTH                     0x00000001

#define _CMSTAT_C4OUT_POSITION                   0x00000003
#define _CMSTAT_C4OUT_MASK                       0x00000008
#define _CMSTAT_C4OUT_LENGTH                     0x00000001

#define _CMSTAT_C5OUT_POSITION                   0x00000004
#define _CMSTAT_C5OUT_MASK                       0x00000010
#define _CMSTAT_C5OUT_LENGTH                     0x00000001

#define _CMSTAT_SIDL_POSITION                    0x0000000D
#define _CMSTAT_SIDL_MASK                        0x00002000
#define _CMSTAT_SIDL_LENGTH                      0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000010
#define _CMSTAT_C1EVT_MASK                       0x00010000
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000011
#define _CMSTAT_C2EVT_MASK                       0x00020000
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CMSTAT_C3EVT_POSITION                   0x00000012
#define _CMSTAT_C3EVT_MASK                       0x00040000
#define _CMSTAT_C3EVT_LENGTH                     0x00000001

#define _CMSTAT_C4EVT_POSITION                   0x00000013
#define _CMSTAT_C4EVT_MASK                       0x00080000
#define _CMSTAT_C4EVT_LENGTH                     0x00000001

#define _CMSTAT_C5EVT_POSITION                   0x00000014
#define _CMSTAT_C5EVT_MASK                       0x00100000
#define _CMSTAT_C5EVT_LENGTH                     0x00000001

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000010
#define _CM1CON_CREF_LENGTH                      0x00000001

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CEVT_POSITION                    0x00000009
#define _CM1CON_CEVT_MASK                        0x00000200
#define _CM1CON_CEVT_LENGTH                      0x00000001

#define _CM1CON_OPLPWR_POSITION                  0x0000000C
#define _CM1CON_OPLPWR_MASK                      0x00001000
#define _CM1CON_OPLPWR_LENGTH                    0x00000001

#define _CM1CON_CPOL_POSITION                    0x0000000D
#define _CM1CON_CPOL_MASK                        0x00002000
#define _CM1CON_CPOL_LENGTH                      0x00000001

#define _CM1CON_COE_POSITION                     0x0000000E
#define _CM1CON_COE_MASK                         0x00004000
#define _CM1CON_COE_LENGTH                       0x00000001

#define _CM1CON_ON_POSITION                      0x0000000F
#define _CM1CON_ON_MASK                          0x00008000
#define _CM1CON_ON_LENGTH                        0x00000001

#define _CM1CON_CFDIV_POSITION                   0x00000010
#define _CM1CON_CFDIV_MASK                       0x00070000
#define _CM1CON_CFDIV_LENGTH                     0x00000003

