Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
#define _ADCCMPCON2_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON2_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON2_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON2_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON2_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON2_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPED_POSITION              0x00000005
#define _ADCCMPCON2_DCMPED_MASK                  0x00000020
#define _ADCCMPCON2_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON2_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON2_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON2_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON2_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON2_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON2_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON2_AINID_POSITION               0x00000008
#define _ADCCMPCON2_AINID_MASK                   0x00001F00
#define _ADCCMPCON2_AINID_LENGTH                 0x00000005

#define _ADCCMPCON3_IELOLO_POSITION              0x00000000
#define _ADCCMPCON3_IELOLO_MASK                  0x00000001
#define _ADCCMPCON3_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON3_IELOHI_POSITION              0x00000001
#define _ADCCMPCON3_IELOHI_MASK                  0x00000002
#define _ADCCMPCON3_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON3_IEHILO_POSITION              0x00000002
#define _ADCCMPCON3_IEHILO_MASK                  0x00000004
#define _ADCCMPCON3_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON3_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON3_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON3_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON3_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON3_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON3_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON3_DCMPED_POSITION              0x00000005
#define _ADCCMPCON3_DCMPED_MASK                  0x00000020
#define _ADCCMPCON3_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON3_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON3_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON3_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON3_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON3_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON3_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON3_AINID_POSITION               0x00000008
#define _ADCCMPCON3_AINID_MASK                   0x00001F00
#define _ADCCMPCON3_AINID_LENGTH                 0x00000005

#define _ADCCMPCON4_IELOLO_POSITION              0x00000000
#define _ADCCMPCON4_IELOLO_MASK                  0x00000001
#define _ADCCMPCON4_IELOLO_LENGTH                0x00000001

#define _ADCCMPCON4_IELOHI_POSITION              0x00000001
#define _ADCCMPCON4_IELOHI_MASK                  0x00000002
#define _ADCCMPCON4_IELOHI_LENGTH                0x00000001

#define _ADCCMPCON4_IEHILO_POSITION              0x00000002
#define _ADCCMPCON4_IEHILO_MASK                  0x00000004
#define _ADCCMPCON4_IEHILO_LENGTH                0x00000001

#define _ADCCMPCON4_IEHIHI_POSITION              0x00000003
#define _ADCCMPCON4_IEHIHI_MASK                  0x00000008
#define _ADCCMPCON4_IEHIHI_LENGTH                0x00000001

#define _ADCCMPCON4_IEBTWN_POSITION              0x00000004
#define _ADCCMPCON4_IEBTWN_MASK                  0x00000010
#define _ADCCMPCON4_IEBTWN_LENGTH                0x00000001

#define _ADCCMPCON4_DCMPED_POSITION              0x00000005
#define _ADCCMPCON4_DCMPED_MASK                  0x00000020
#define _ADCCMPCON4_DCMPED_LENGTH                0x00000001

#define _ADCCMPCON4_DCMPGIEN_POSITION            0x00000006
#define _ADCCMPCON4_DCMPGIEN_MASK                0x00000040
#define _ADCCMPCON4_DCMPGIEN_LENGTH              0x00000001

#define _ADCCMPCON4_ENDCMP_POSITION              0x00000007
#define _ADCCMPCON4_ENDCMP_MASK                  0x00000080
#define _ADCCMPCON4_ENDCMP_LENGTH                0x00000001

#define _ADCCMPCON4_AINID_POSITION               0x00000008
#define _ADCCMPCON4_AINID_MASK                   0x00001F00
#define _ADCCMPCON4_AINID_LENGTH                 0x00000005

#define _ADCBASE_ADCBASE_POSITION                0x00000000
#define _ADCBASE_ADCBASE_MASK                    0x0000FFFF
#define _ADCBASE_ADCBASE_LENGTH                  0x00000010

#define _ADCDSTAT_RAF0_POSITION                  0x00000000
#define _ADCDSTAT_RAF0_MASK                      0x00000001
#define _ADCDSTAT_RAF0_LENGTH                    0x00000001

#define _ADCDSTAT_RAF1_POSITION                  0x00000001
#define _ADCDSTAT_RAF1_MASK                      0x00000002
#define _ADCDSTAT_RAF1_LENGTH                    0x00000001

#define _ADCDSTAT_RAF2_POSITION                  0x00000002
#define _ADCDSTAT_RAF2_MASK                      0x00000004
#define _ADCDSTAT_RAF2_LENGTH                    0x00000001

#define _ADCDSTAT_RAF3_POSITION                  0x00000003
#define _ADCDSTAT_RAF3_MASK                      0x00000008
#define _ADCDSTAT_RAF3_LENGTH                    0x00000001

#define _ADCDSTAT_RAF4_POSITION                  0x00000004
#define _ADCDSTAT_RAF4_MASK                      0x00000010
#define _ADCDSTAT_RAF4_LENGTH                    0x00000001

#define _ADCDSTAT_RAF5_POSITION                  0x00000005
#define _ADCDSTAT_RAF5_MASK                      0x00000020
#define _ADCDSTAT_RAF5_LENGTH                    0x00000001

#define _ADCDSTAT_RAFIEN0_POSITION               0x00000008
#define _ADCDSTAT_RAFIEN0_MASK                   0x00000100
#define _ADCDSTAT_RAFIEN0_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN1_POSITION               0x00000009
#define _ADCDSTAT_RAFIEN1_MASK                   0x00000200
#define _ADCDSTAT_RAFIEN1_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN2_POSITION               0x0000000A
#define _ADCDSTAT_RAFIEN2_MASK                   0x00000400
#define _ADCDSTAT_RAFIEN2_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN3_POSITION               0x0000000B
#define _ADCDSTAT_RAFIEN3_MASK                   0x00000800
#define _ADCDSTAT_RAFIEN3_LENGTH                 0x00000001

#define _ADCDSTAT_RAFIEN4_POSITION               0x0000000C
#define _ADCDSTAT_RAFIEN4_MASK                   0x00001000
#define _ADCDSTAT_RAFIEN4_LENGTH                 0x00000001

