Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/include/proc/p32mk0512mcj064.h
#define _BF1DEVCFG0_POSCAGCRNG_POSITION          0x0000001A
#define _BF1DEVCFG0_POSCAGCRNG_MASK              0x04000000
#define _BF1DEVCFG0_POSCAGCRNG_LENGTH            0x00000001

#define _BF1DEVCFG0_POSCAGC_POSITION             0x0000001B
#define _BF1DEVCFG0_POSCAGC_MASK                 0x08000000
#define _BF1DEVCFG0_POSCAGC_LENGTH               0x00000001

#define _BF1DEVCFG0_EJTAGBEN_POSITION            0x0000001E
#define _BF1DEVCFG0_EJTAGBEN_MASK                0x40000000
#define _BF1DEVCFG0_EJTAGBEN_LENGTH              0x00000001

#define _BF1DEVCFG0_FDEBUG_POSITION              0x00000000
#define _BF1DEVCFG0_FDEBUG_MASK                  0x00000003
#define _BF1DEVCFG0_FDEBUG_LENGTH                0x00000002

#define _BF1DEVCFG0_w_POSITION                   0x00000000
#define _BF1DEVCFG0_w_MASK                       0xFFFFFFFF
#define _BF1DEVCFG0_w_LENGTH                     0x00000020

#define _BF1DEVCP_CP_POSITION                    0x0000001C
#define _BF1DEVCP_CP_MASK                        0x10000000
#define _BF1DEVCP_CP_LENGTH                      0x00000001

#define _BF1DEVCP_w_POSITION                     0x00000000
#define _BF1DEVCP_w_MASK                         0xFFFFFFFF
#define _BF1DEVCP_w_LENGTH                       0x00000020

#define _BF1SEQ_TSEQ_POSITION                    0x00000000
#define _BF1SEQ_TSEQ_MASK                        0x0000FFFF
#define _BF1SEQ_TSEQ_LENGTH                      0x00000010

#define _BF1SEQ_CSEQ_POSITION                    0x00000010
#define _BF1SEQ_CSEQ_MASK                        0xFFFF0000
#define _BF1SEQ_CSEQ_LENGTH                      0x00000010

#define _BF1SEQ_w_POSITION                       0x00000000
#define _BF1SEQ_w_MASK                           0xFFFFFFFF
#define _BF1SEQ_w_LENGTH                         0x00000020

/* Vector Numbers */
#define _CORE_TIMER_VECTOR                       0
#define _CORE_SOFTWARE_0_VECTOR                  1
#define _CORE_SOFTWARE_1_VECTOR                  2
#define _EXTERNAL_0_VECTOR                       3
#define _TIMER_1_VECTOR                          4
#define _INPUT_CAPTURE_1_ERROR_VECTOR            5
#define _INPUT_CAPTURE_1_VECTOR                  6
#define _OUTPUT_COMPARE_1_VECTOR                 7
#define _EXTERNAL_1_VECTOR                       8
#define _TIMER_2_VECTOR                          9
#define _INPUT_CAPTURE_2_ERROR_VECTOR            10
#define _INPUT_CAPTURE_2_VECTOR                  11
#define _OUTPUT_COMPARE_2_VECTOR                 12
#define _EXTERNAL_2_VECTOR                       13
#define _TIMER_3_VECTOR                          14
#define _INPUT_CAPTURE_3_ERROR_VECTOR            15
#define _INPUT_CAPTURE_3_VECTOR                  16
#define _OUTPUT_COMPARE_3_VECTOR                 17
#define _EXTERNAL_3_VECTOR                       18
#define _TIMER_4_VECTOR                          19
#define _INPUT_CAPTURE_4_ERROR_VECTOR            20
#define _INPUT_CAPTURE_4_VECTOR                  21
#define _OUTPUT_COMPARE_4_VECTOR                 22
#define _EXTERNAL_4_VECTOR                       23
#define _TIMER_5_VECTOR                          24
#define _INPUT_CAPTURE_5_ERROR_VECTOR            25
#define _INPUT_CAPTURE_5_VECTOR                  26
#define _OUTPUT_COMPARE_5_VECTOR                 27
#define _RTCC_VECTOR                             30
#define _FLASH_CONTROL_VECTOR                    31
#define _COMPARATOR_1_VECTOR                     32
#define _COMPARATOR_2_VECTOR                     33
#define _SPI1_FAULT_VECTOR                       35
#define _SPI1_RX_VECTOR                          36
#define _SPI1_TX_VECTOR                          37
#define _UART1_FAULT_VECTOR                      38
#define _UART1_RX_VECTOR                         39
#define _UART1_TX_VECTOR                         40
#define _I2C1_BUS_VECTOR                         41
#define _I2C1_SLAVE_VECTOR                       42
#define _I2C1_MASTER_VECTOR                      43
#define _CHANGE_NOTICE_A_VECTOR                  44
#define _CHANGE_NOTICE_B_VECTOR                  45
#define _CHANGE_NOTICE_C_VECTOR                  46
#define _CHANGE_NOTICE_D_VECTOR                  47
#define _CHANGE_NOTICE_E_VECTOR                  48
#define _CHANGE_NOTICE_F_VECTOR                  49
#define _CHANGE_NOTICE_G_VECTOR                  50
#define _SPI2_FAULT_VECTOR                       53
#define _SPI2_RX_VECTOR                          54
#define _SPI2_TX_VECTOR                          55
#define _UART2_FAULT_VECTOR                      56
#define _UART2_RX_VECTOR                         57
#define _UART2_TX_VECTOR                         58
#define _I2C2_BUS_VECTOR                         59
#define _I2C2_SLAVE_VECTOR                       60
#define _I2C2_MASTER_VECTOR                      61
#define _CTMU_VECTOR                             71
#define _DMA0_VECTOR                             72
#define _DMA1_VECTOR                             73
#define _DMA2_VECTOR                             74
#define _DMA3_VECTOR                             75
#define _TIMER_6_VECTOR                          76
#define _INPUT_CAPTURE_6_ERROR_VECTOR            77
#define _INPUT_CAPTURE_6_VECTOR                  78
#define _OUTPUT_COMPARE_6_VECTOR                 79
#define _TIMER_7_VECTOR                          80
#define _INPUT_CAPTURE_7_ERROR_VECTOR            81
#define _INPUT_CAPTURE_7_VECTOR                  82
#define _OUTPUT_COMPARE_7_VECTOR                 83
#define _TIMER_8_VECTOR                          84
#define _INPUT_CAPTURE_8_ERROR_VECTOR            85
#define _INPUT_CAPTURE_8_VECTOR                  86
#define _OUTPUT_COMPARE_8_VECTOR                 87
#define _TIMER_9_VECTOR                          88
#define _INPUT_CAPTURE_9_ERROR_VECTOR            89
#define _INPUT_CAPTURE_9_VECTOR                  90
#define _OUTPUT_COMPARE_9_VECTOR                 91
#define _ADC_VECTOR                              92
#define _ADC_DC1_VECTOR                          94
#define _ADC_DC2_VECTOR                          95
#define _ADC_DF1_VECTOR                          96
#define _ADC_DF2_VECTOR                          97
#define _ADC_DF3_VECTOR                          98
#define _ADC_DF4_VECTOR                          99
#define _ADC_FAULT_VECTOR                        100
#define _ADC_EOS_VECTOR                          101
#define _ADC_ARDY_VECTOR                         102
#define _ADC_URDY_VECTOR                         103
#define _ADC_DMA_VECTOR                          104
#define _ADC_EARLY_VECTOR                        105
#define _ADC_DATA0_VECTOR                        106
#define _ADC_DATA1_VECTOR                        107
#define _ADC_DATA2_VECTOR                        108
#define _ADC_DATA3_VECTOR                        109
#define _ADC_DATA4_VECTOR                        110
#define _ADC_DATA5_VECTOR                        111
#define _ADC_DATA6_VECTOR                        112
#define _ADC_DATA7_VECTOR                        113
#define _ADC_DATA8_VECTOR                        114
#define _ADC_DATA9_VECTOR                        115
#define _ADC_DATA10_VECTOR                       116
#define _ADC_DATA11_VECTOR                       117
#define _ADC_DATA12_VECTOR                       118
#define _ADC_DATA13_VECTOR                       119
#define _ADC_DATA14_VECTOR                       120
#define _ADC_DATA15_VECTOR                       121
#define _ADC_DATA16_VECTOR                       122
#define _ADC_DATA17_VECTOR                       123
#define _ADC_DATA18_VECTOR                       124
#define _ADC_DATA19_VECTOR                       125
#define _ADC_DATA24_VECTOR                       130
#define _ADC_DATA25_VECTOR                       131
#define _ADC_DATA26_VECTOR                       132
#define _ADC_DATA27_VECTOR                       133
#define _ADC_DATA40_VECTOR                       146
#define _ADC_DATA41_VECTOR                       147
#define _ADC_DATA46_VECTOR                       152
#define _ADC_DATA47_VECTOR                       153
#define _ADC_DATA48_VECTOR                       154
#define _ADC_DATA49_VECTOR                       155
#define _ADC_DATA50_VECTOR                       156
#define _ADC_DATA51_VECTOR                       157
#define _ADC_DATA52_VECTOR                       158
#define _ADC_DATA53_VECTOR                       159
#define _COMPARATOR_3_VECTOR                     160
#define _COMPARATOR_4_VECTOR                     161
#define _COMPARATOR_5_VECTOR                     162
#define _CAN1_VECTOR                             167
#define _QEI1_VECTOR                             169
#define _QEI2_VECTOR                             170
#define _PWM_PRI_VECTOR                          171
#define _PWM_SEC_VECTOR                          172
#define _PWM1_VECTOR                             173
#define _PWM2_VECTOR                             174
#define _PWM3_VECTOR                             175
#define _PWM4_VECTOR                             176
#define _PWM5_VECTOR                             177
#define _PWM6_VECTOR                             178
#define _DMA4_VECTOR                             182
#define _DMA5_VECTOR                             183
#define _DMA6_VECTOR                             184
#define _DMA7_VECTOR                             185
#define _QEI3_VECTOR                             189
#define _SYSTEM_BUS_PROTECTION_VECTOR            230
#define _PWM7_VECTOR                             238
#define _PWM8_VECTOR                             239
#define _PWM9_VECTOR                             240
#define _ADC_DC3_VECTOR                          245
#define _ADC_DC4_VECTOR                          246
#define _PCACHE_VECTOR                           247
#define _CLC1_VECTOR                             249
#define _CLC2_VECTOR                             250
#define _CLC3_VECTOR                             251
#define _CLC4_VECTOR                             252
#define _CORE_PERF_COUNT_VECTOR                  254
#define _CORE_FAST_DEBUG_CHAN_VECTOR             255

/* Device Peripherals */
#define _ADCHS
#define _CAN1
#define _CDAC1
#define _CDAC2
#define _CFG
#define _CLC1
#define _CLC2
#define _CLC3
#define _CLC4
#define _CMP1
#define _CMP2
#define _CMP3
#define _CMP4
#define _CMP5
#define _CRU
#define _CTMU
#define _DMAC
#define _DMT
#define _HLVD
#define _I2C1
#define _I2C2
#define _ICAP1
#define _ICAP2
#define _ICAP3
#define _ICAP4
#define _ICAP5
#define _ICAP6
#define _ICAP7
#define _ICAP8
#define _ICAP9
#define _INT
#define _MCPWMCHANNEL
#define _MCPWMMODULE
#define _NVM
#define _OCMP1
#define _OCMP2
#define _OCMP3
#define _OCMP4
#define _OCMP5
#define _OCMP6
#define _OCMP7
#define _OCMP8
#define _OCMP9
#define _PCACHE
#define _PORTA
#define _PORTB
#define _PORTC
#define _PORTD
#define _PORTE
#define _PORTF
#define _PORTG
#define _RTCC
#define _SB
#define _SPI1
#define _SPI2
#define _TMR1
#define _TMR2
#define _TMR3
#define _TMR4
#define _TMR5
#define _TMR6
#define _TMR7
#define _TMR8
#define _TMR9
#define _UART1
#define _UART2
#define _UARTAB
#define _UARTCD
#define _WDT
#define __DDPSTAT

